Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x193c (32-bit)
   Version:       4
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x39138): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m3 -mfloat-abi=soft -mthumb -march=armv7-m -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0x7b892): ../Core/Src/main.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0x20e70): E:/PLC NEXT/DRIVER STM32/CODE/Debug
    <19>   DW_AT_ranges      : 0x0
    <1d>   DW_AT_low_pc      : 0x0
    <21>   DW_AT_stmt_list   : 0x0
    <25>   DW_AT_GNU_macros  : 0x0
 <1><29>: Abbrev Number: 2 (DW_TAG_base_type)
    <2a>   DW_AT_byte_size   : 1
    <2b>   DW_AT_encoding    : 6	(signed char)
    <2c>   DW_AT_name        : (indirect string, offset: 0x45da9): signed char
 <1><30>: Abbrev Number: 3 (DW_TAG_typedef)
    <31>   DW_AT_name        : (indirect string, offset: 0x28762): __uint8_t
    <35>   DW_AT_decl_file   : 3
    <36>   DW_AT_decl_line   : 43
    <37>   DW_AT_decl_column : 24
    <38>   DW_AT_type        : <0x3c>
 <1><3c>: Abbrev Number: 2 (DW_TAG_base_type)
    <3d>   DW_AT_byte_size   : 1
    <3e>   DW_AT_encoding    : 8	(unsigned char)
    <3f>   DW_AT_name        : (indirect string, offset: 0x1bf34): unsigned char
 <1><43>: Abbrev Number: 2 (DW_TAG_base_type)
    <44>   DW_AT_byte_size   : 2
    <45>   DW_AT_encoding    : 5	(signed)
    <46>   DW_AT_name        : (indirect string, offset: 0x679d2): short int
 <1><4a>: Abbrev Number: 3 (DW_TAG_typedef)
    <4b>   DW_AT_name        : (indirect string, offset: 0x714ec): __uint16_t
    <4f>   DW_AT_decl_file   : 3
    <50>   DW_AT_decl_line   : 57
    <51>   DW_AT_decl_column : 25
    <52>   DW_AT_type        : <0x56>
 <1><56>: Abbrev Number: 2 (DW_TAG_base_type)
    <57>   DW_AT_byte_size   : 2
    <58>   DW_AT_encoding    : 7	(unsigned)
    <59>   DW_AT_name        : (indirect string, offset: 0x2de98): short unsigned int
 <1><5d>: Abbrev Number: 2 (DW_TAG_base_type)
    <5e>   DW_AT_byte_size   : 4
    <5f>   DW_AT_encoding    : 5	(signed)
    <60>   DW_AT_name        : (indirect string, offset: 0xc336): long int
 <1><64>: Abbrev Number: 3 (DW_TAG_typedef)
    <65>   DW_AT_name        : (indirect string, offset: 0x587d6): __uint32_t
    <69>   DW_AT_decl_file   : 3
    <6a>   DW_AT_decl_line   : 79
    <6b>   DW_AT_decl_column : 25
    <6c>   DW_AT_type        : <0x70>
 <1><70>: Abbrev Number: 2 (DW_TAG_base_type)
    <71>   DW_AT_byte_size   : 4
    <72>   DW_AT_encoding    : 7	(unsigned)
    <73>   DW_AT_name        : (indirect string, offset: 0x3fed5): long unsigned int
 <1><77>: Abbrev Number: 2 (DW_TAG_base_type)
    <78>   DW_AT_byte_size   : 8
    <79>   DW_AT_encoding    : 5	(signed)
    <7a>   DW_AT_name        : (indirect string, offset: 0x401de): long long int
 <1><7e>: Abbrev Number: 2 (DW_TAG_base_type)
    <7f>   DW_AT_byte_size   : 8
    <80>   DW_AT_encoding    : 7	(unsigned)
    <81>   DW_AT_name        : (indirect string, offset: 0x1ca37): long long unsigned int
 <1><85>: Abbrev Number: 4 (DW_TAG_base_type)
    <86>   DW_AT_byte_size   : 4
    <87>   DW_AT_encoding    : 5	(signed)
    <88>   DW_AT_name        : int
 <1><8c>: Abbrev Number: 2 (DW_TAG_base_type)
    <8d>   DW_AT_byte_size   : 4
    <8e>   DW_AT_encoding    : 7	(unsigned)
    <8f>   DW_AT_name        : (indirect string, offset: 0xbc62): unsigned int
 <1><93>: Abbrev Number: 3 (DW_TAG_typedef)
    <94>   DW_AT_name        : (indirect string, offset: 0x28764): uint8_t
    <98>   DW_AT_decl_file   : 4
    <99>   DW_AT_decl_line   : 24
    <9a>   DW_AT_decl_column : 19
    <9b>   DW_AT_type        : <0x30>
 <1><9f>: Abbrev Number: 3 (DW_TAG_typedef)
    <a0>   DW_AT_name        : (indirect string, offset: 0x714ee): uint16_t
    <a4>   DW_AT_decl_file   : 4
    <a5>   DW_AT_decl_line   : 36
    <a6>   DW_AT_decl_column : 20
    <a7>   DW_AT_type        : <0x4a>
 <1><ab>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <ac>   DW_AT_type        : <0x9f>
 <1><b0>: Abbrev Number: 3 (DW_TAG_typedef)
    <b1>   DW_AT_name        : (indirect string, offset: 0x587d8): uint32_t
    <b5>   DW_AT_decl_file   : 4
    <b6>   DW_AT_decl_line   : 48
    <b7>   DW_AT_decl_column : 20
    <b8>   DW_AT_type        : <0x64>
 <1><bc>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <bd>   DW_AT_type        : <0xb0>
 <1><c1>: Abbrev Number: 6 (DW_TAG_structure_type)
    <c2>   DW_AT_byte_size   : 80
    <c3>   DW_AT_decl_file   : 5
    <c4>   DW_AT_decl_line   : 139
    <c5>   DW_AT_decl_column : 9
    <c6>   DW_AT_sibling     : <0x1cd>
 <2><ca>: Abbrev Number: 7 (DW_TAG_member)
    <cb>   DW_AT_name        : SR
    <ce>   DW_AT_decl_file   : 5
    <cf>   DW_AT_decl_line   : 141
    <d0>   DW_AT_decl_column : 17
    <d1>   DW_AT_type        : <0xbc>
    <d5>   DW_AT_data_member_location: 0
 <2><d6>: Abbrev Number: 7 (DW_TAG_member)
    <d7>   DW_AT_name        : CR1
    <db>   DW_AT_decl_file   : 5
    <dc>   DW_AT_decl_line   : 142
    <dd>   DW_AT_decl_column : 17
    <de>   DW_AT_type        : <0xbc>
    <e2>   DW_AT_data_member_location: 4
 <2><e3>: Abbrev Number: 7 (DW_TAG_member)
    <e4>   DW_AT_name        : CR2
    <e8>   DW_AT_decl_file   : 5
    <e9>   DW_AT_decl_line   : 143
    <ea>   DW_AT_decl_column : 17
    <eb>   DW_AT_type        : <0xbc>
    <ef>   DW_AT_data_member_location: 8
 <2><f0>: Abbrev Number: 8 (DW_TAG_member)
    <f1>   DW_AT_name        : (indirect string, offset: 0x7c861): SMPR1
    <f5>   DW_AT_decl_file   : 5
    <f6>   DW_AT_decl_line   : 144
    <f7>   DW_AT_decl_column : 17
    <f8>   DW_AT_type        : <0xbc>
    <fc>   DW_AT_data_member_location: 12
 <2><fd>: Abbrev Number: 8 (DW_TAG_member)
    <fe>   DW_AT_name        : (indirect string, offset: 0x32234): SMPR2
    <102>   DW_AT_decl_file   : 5
    <103>   DW_AT_decl_line   : 145
    <104>   DW_AT_decl_column : 17
    <105>   DW_AT_type        : <0xbc>
    <109>   DW_AT_data_member_location: 16
 <2><10a>: Abbrev Number: 8 (DW_TAG_member)
    <10b>   DW_AT_name        : (indirect string, offset: 0x3058e): JOFR1
    <10f>   DW_AT_decl_file   : 5
    <110>   DW_AT_decl_line   : 146
    <111>   DW_AT_decl_column : 17
    <112>   DW_AT_type        : <0xbc>
    <116>   DW_AT_data_member_location: 20
 <2><117>: Abbrev Number: 8 (DW_TAG_member)
    <118>   DW_AT_name        : (indirect string, offset: 0x30594): JOFR2
    <11c>   DW_AT_decl_file   : 5
    <11d>   DW_AT_decl_line   : 147
    <11e>   DW_AT_decl_column : 17
    <11f>   DW_AT_type        : <0xbc>
    <123>   DW_AT_data_member_location: 24
 <2><124>: Abbrev Number: 8 (DW_TAG_member)
    <125>   DW_AT_name        : (indirect string, offset: 0x3059a): JOFR3
    <129>   DW_AT_decl_file   : 5
    <12a>   DW_AT_decl_line   : 148
    <12b>   DW_AT_decl_column : 17
    <12c>   DW_AT_type        : <0xbc>
    <130>   DW_AT_data_member_location: 28
 <2><131>: Abbrev Number: 8 (DW_TAG_member)
    <132>   DW_AT_name        : (indirect string, offset: 0x305a0): JOFR4
    <136>   DW_AT_decl_file   : 5
    <137>   DW_AT_decl_line   : 149
    <138>   DW_AT_decl_column : 17
    <139>   DW_AT_type        : <0xbc>
    <13d>   DW_AT_data_member_location: 32
 <2><13e>: Abbrev Number: 7 (DW_TAG_member)
    <13f>   DW_AT_name        : HTR
    <143>   DW_AT_decl_file   : 5
    <144>   DW_AT_decl_line   : 150
    <145>   DW_AT_decl_column : 17
    <146>   DW_AT_type        : <0xbc>
    <14a>   DW_AT_data_member_location: 36
 <2><14b>: Abbrev Number: 7 (DW_TAG_member)
    <14c>   DW_AT_name        : LTR
    <150>   DW_AT_decl_file   : 5
    <151>   DW_AT_decl_line   : 151
    <152>   DW_AT_decl_column : 17
    <153>   DW_AT_type        : <0xbc>
    <157>   DW_AT_data_member_location: 40
 <2><158>: Abbrev Number: 8 (DW_TAG_member)
    <159>   DW_AT_name        : (indirect string, offset: 0xc445): SQR1
    <15d>   DW_AT_decl_file   : 5
    <15e>   DW_AT_decl_line   : 152
    <15f>   DW_AT_decl_column : 17
    <160>   DW_AT_type        : <0xbc>
    <164>   DW_AT_data_member_location: 44
 <2><165>: Abbrev Number: 8 (DW_TAG_member)
    <166>   DW_AT_name        : (indirect string, offset: 0xaf3f): SQR2
    <16a>   DW_AT_decl_file   : 5
    <16b>   DW_AT_decl_line   : 153
    <16c>   DW_AT_decl_column : 17
    <16d>   DW_AT_type        : <0xbc>
    <171>   DW_AT_data_member_location: 48
 <2><172>: Abbrev Number: 8 (DW_TAG_member)
    <173>   DW_AT_name        : (indirect string, offset: 0xaf44): SQR3
    <177>   DW_AT_decl_file   : 5
    <178>   DW_AT_decl_line   : 154
    <179>   DW_AT_decl_column : 17
    <17a>   DW_AT_type        : <0xbc>
    <17e>   DW_AT_data_member_location: 52
 <2><17f>: Abbrev Number: 8 (DW_TAG_member)
    <180>   DW_AT_name        : (indirect string, offset: 0x6ae1a): JSQR
    <184>   DW_AT_decl_file   : 5
    <185>   DW_AT_decl_line   : 155
    <186>   DW_AT_decl_column : 17
    <187>   DW_AT_type        : <0xbc>
    <18b>   DW_AT_data_member_location: 56
 <2><18c>: Abbrev Number: 8 (DW_TAG_member)
    <18d>   DW_AT_name        : (indirect string, offset: 0x59188): JDR1
    <191>   DW_AT_decl_file   : 5
    <192>   DW_AT_decl_line   : 156
    <193>   DW_AT_decl_column : 17
    <194>   DW_AT_type        : <0xbc>
    <198>   DW_AT_data_member_location: 60
 <2><199>: Abbrev Number: 8 (DW_TAG_member)
    <19a>   DW_AT_name        : (indirect string, offset: 0x5918d): JDR2
    <19e>   DW_AT_decl_file   : 5
    <19f>   DW_AT_decl_line   : 157
    <1a0>   DW_AT_decl_column : 17
    <1a1>   DW_AT_type        : <0xbc>
    <1a5>   DW_AT_data_member_location: 64
 <2><1a6>: Abbrev Number: 8 (DW_TAG_member)
    <1a7>   DW_AT_name        : (indirect string, offset: 0x59192): JDR3
    <1ab>   DW_AT_decl_file   : 5
    <1ac>   DW_AT_decl_line   : 158
    <1ad>   DW_AT_decl_column : 17
    <1ae>   DW_AT_type        : <0xbc>
    <1b2>   DW_AT_data_member_location: 68
 <2><1b3>: Abbrev Number: 8 (DW_TAG_member)
    <1b4>   DW_AT_name        : (indirect string, offset: 0x24ad0): JDR4
    <1b8>   DW_AT_decl_file   : 5
    <1b9>   DW_AT_decl_line   : 159
    <1ba>   DW_AT_decl_column : 17
    <1bb>   DW_AT_type        : <0xbc>
    <1bf>   DW_AT_data_member_location: 72
 <2><1c0>: Abbrev Number: 7 (DW_TAG_member)
    <1c1>   DW_AT_name        : DR
    <1c4>   DW_AT_decl_file   : 5
    <1c5>   DW_AT_decl_line   : 160
    <1c6>   DW_AT_decl_column : 17
    <1c7>   DW_AT_type        : <0xbc>
    <1cb>   DW_AT_data_member_location: 76
 <2><1cc>: Abbrev Number: 0
 <1><1cd>: Abbrev Number: 3 (DW_TAG_typedef)
    <1ce>   DW_AT_name        : (indirect string, offset: 0x6acb2): ADC_TypeDef
    <1d2>   DW_AT_decl_file   : 5
    <1d3>   DW_AT_decl_line   : 161
    <1d4>   DW_AT_decl_column : 3
    <1d5>   DW_AT_type        : <0xc1>
 <1><1d9>: Abbrev Number: 9 (DW_TAG_structure_type)
    <1da>   DW_AT_byte_size   : 16
    <1db>   DW_AT_decl_file   : 5
    <1dc>   DW_AT_decl_line   : 286
    <1de>   DW_AT_decl_column : 9
    <1df>   DW_AT_sibling     : <0x21c>
 <2><1e3>: Abbrev Number: 10 (DW_TAG_member)
    <1e4>   DW_AT_name        : CCR
    <1e8>   DW_AT_decl_file   : 5
    <1e9>   DW_AT_decl_line   : 288
    <1eb>   DW_AT_decl_column : 17
    <1ec>   DW_AT_type        : <0xbc>
    <1f0>   DW_AT_data_member_location: 0
 <2><1f1>: Abbrev Number: 11 (DW_TAG_member)
    <1f2>   DW_AT_name        : (indirect string, offset: 0x35f99): CNDTR
    <1f6>   DW_AT_decl_file   : 5
    <1f7>   DW_AT_decl_line   : 289
    <1f9>   DW_AT_decl_column : 17
    <1fa>   DW_AT_type        : <0xbc>
    <1fe>   DW_AT_data_member_location: 4
 <2><1ff>: Abbrev Number: 11 (DW_TAG_member)
    <200>   DW_AT_name        : (indirect string, offset: 0x85508): CPAR
    <204>   DW_AT_decl_file   : 5
    <205>   DW_AT_decl_line   : 290
    <207>   DW_AT_decl_column : 17
    <208>   DW_AT_type        : <0xbc>
    <20c>   DW_AT_data_member_location: 8
 <2><20d>: Abbrev Number: 11 (DW_TAG_member)
    <20e>   DW_AT_name        : (indirect string, offset: 0x4d042): CMAR
    <212>   DW_AT_decl_file   : 5
    <213>   DW_AT_decl_line   : 291
    <215>   DW_AT_decl_column : 17
    <216>   DW_AT_type        : <0xbc>
    <21a>   DW_AT_data_member_location: 12
 <2><21b>: Abbrev Number: 0
 <1><21c>: Abbrev Number: 12 (DW_TAG_typedef)
    <21d>   DW_AT_name        : (indirect string, offset: 0x70d33): DMA_Channel_TypeDef
    <221>   DW_AT_decl_file   : 5
    <222>   DW_AT_decl_line   : 292
    <224>   DW_AT_decl_column : 3
    <225>   DW_AT_type        : <0x1d9>
 <1><229>: Abbrev Number: 9 (DW_TAG_structure_type)
    <22a>   DW_AT_byte_size   : 8
    <22b>   DW_AT_decl_file   : 5
    <22c>   DW_AT_decl_line   : 294
    <22e>   DW_AT_decl_column : 9
    <22f>   DW_AT_sibling     : <0x250>
 <2><233>: Abbrev Number: 10 (DW_TAG_member)
    <234>   DW_AT_name        : ISR
    <238>   DW_AT_decl_file   : 5
    <239>   DW_AT_decl_line   : 296
    <23b>   DW_AT_decl_column : 17
    <23c>   DW_AT_type        : <0xbc>
    <240>   DW_AT_data_member_location: 0
 <2><241>: Abbrev Number: 11 (DW_TAG_member)
    <242>   DW_AT_name        : (indirect string, offset: 0x61aba): IFCR
    <246>   DW_AT_decl_file   : 5
    <247>   DW_AT_decl_line   : 297
    <249>   DW_AT_decl_column : 17
    <24a>   DW_AT_type        : <0xbc>
    <24e>   DW_AT_data_member_location: 4
 <2><24f>: Abbrev Number: 0
 <1><250>: Abbrev Number: 12 (DW_TAG_typedef)
    <251>   DW_AT_name        : (indirect string, offset: 0x32eb4): DMA_TypeDef
    <255>   DW_AT_decl_file   : 5
    <256>   DW_AT_decl_line   : 298
    <258>   DW_AT_decl_column : 3
    <259>   DW_AT_type        : <0x229>
 <1><25d>: Abbrev Number: 9 (DW_TAG_structure_type)
    <25e>   DW_AT_byte_size   : 28
    <25f>   DW_AT_decl_file   : 5
    <260>   DW_AT_decl_line   : 353
    <262>   DW_AT_decl_column : 9
    <263>   DW_AT_sibling     : <0x2ca>
 <2><267>: Abbrev Number: 10 (DW_TAG_member)
    <268>   DW_AT_name        : CRL
    <26c>   DW_AT_decl_file   : 5
    <26d>   DW_AT_decl_line   : 355
    <26f>   DW_AT_decl_column : 17
    <270>   DW_AT_type        : <0xbc>
    <274>   DW_AT_data_member_location: 0
 <2><275>: Abbrev Number: 10 (DW_TAG_member)
    <276>   DW_AT_name        : CRH
    <27a>   DW_AT_decl_file   : 5
    <27b>   DW_AT_decl_line   : 356
    <27d>   DW_AT_decl_column : 17
    <27e>   DW_AT_type        : <0xbc>
    <282>   DW_AT_data_member_location: 4
 <2><283>: Abbrev Number: 10 (DW_TAG_member)
    <284>   DW_AT_name        : IDR
    <288>   DW_AT_decl_file   : 5
    <289>   DW_AT_decl_line   : 357
    <28b>   DW_AT_decl_column : 17
    <28c>   DW_AT_type        : <0xbc>
    <290>   DW_AT_data_member_location: 8
 <2><291>: Abbrev Number: 10 (DW_TAG_member)
    <292>   DW_AT_name        : ODR
    <296>   DW_AT_decl_file   : 5
    <297>   DW_AT_decl_line   : 358
    <299>   DW_AT_decl_column : 17
    <29a>   DW_AT_type        : <0xbc>
    <29e>   DW_AT_data_member_location: 12
 <2><29f>: Abbrev Number: 11 (DW_TAG_member)
    <2a0>   DW_AT_name        : (indirect string, offset: 0x1efcc): BSRR
    <2a4>   DW_AT_decl_file   : 5
    <2a5>   DW_AT_decl_line   : 359
    <2a7>   DW_AT_decl_column : 17
    <2a8>   DW_AT_type        : <0xbc>
    <2ac>   DW_AT_data_member_location: 16
 <2><2ad>: Abbrev Number: 10 (DW_TAG_member)
    <2ae>   DW_AT_name        : BRR
    <2b2>   DW_AT_decl_file   : 5
    <2b3>   DW_AT_decl_line   : 360
    <2b5>   DW_AT_decl_column : 17
    <2b6>   DW_AT_type        : <0xbc>
    <2ba>   DW_AT_data_member_location: 20
 <2><2bb>: Abbrev Number: 11 (DW_TAG_member)
    <2bc>   DW_AT_name        : (indirect string, offset: 0x76f54): LCKR
    <2c0>   DW_AT_decl_file   : 5
    <2c1>   DW_AT_decl_line   : 361
    <2c3>   DW_AT_decl_column : 17
    <2c4>   DW_AT_type        : <0xbc>
    <2c8>   DW_AT_data_member_location: 24
 <2><2c9>: Abbrev Number: 0
 <1><2ca>: Abbrev Number: 12 (DW_TAG_typedef)
    <2cb>   DW_AT_name        : (indirect string, offset: 0x85fa7): GPIO_TypeDef
    <2cf>   DW_AT_decl_file   : 5
    <2d0>   DW_AT_decl_line   : 362
    <2d2>   DW_AT_decl_column : 3
    <2d3>   DW_AT_type        : <0x25d>
 <1><2d7>: Abbrev Number: 9 (DW_TAG_structure_type)
    <2d8>   DW_AT_byte_size   : 40
    <2d9>   DW_AT_decl_file   : 5
    <2da>   DW_AT_decl_line   : 419
    <2dc>   DW_AT_decl_column : 9
    <2dd>   DW_AT_sibling     : <0x36d>
 <2><2e1>: Abbrev Number: 10 (DW_TAG_member)
    <2e2>   DW_AT_name        : CR
    <2e5>   DW_AT_decl_file   : 5
    <2e6>   DW_AT_decl_line   : 421
    <2e8>   DW_AT_decl_column : 17
    <2e9>   DW_AT_type        : <0xbc>
    <2ed>   DW_AT_data_member_location: 0
 <2><2ee>: Abbrev Number: 11 (DW_TAG_member)
    <2ef>   DW_AT_name        : (indirect string, offset: 0x548a6): CFGR
    <2f3>   DW_AT_decl_file   : 5
    <2f4>   DW_AT_decl_line   : 422
    <2f6>   DW_AT_decl_column : 17
    <2f7>   DW_AT_type        : <0xbc>
    <2fb>   DW_AT_data_member_location: 4
 <2><2fc>: Abbrev Number: 10 (DW_TAG_member)
    <2fd>   DW_AT_name        : CIR
    <301>   DW_AT_decl_file   : 5
    <302>   DW_AT_decl_line   : 423
    <304>   DW_AT_decl_column : 17
    <305>   DW_AT_type        : <0xbc>
    <309>   DW_AT_data_member_location: 8
 <2><30a>: Abbrev Number: 11 (DW_TAG_member)
    <30b>   DW_AT_name        : (indirect string, offset: 0x3d10e): APB2RSTR
    <30f>   DW_AT_decl_file   : 5
    <310>   DW_AT_decl_line   : 424
    <312>   DW_AT_decl_column : 17
    <313>   DW_AT_type        : <0xbc>
    <317>   DW_AT_data_member_location: 12
 <2><318>: Abbrev Number: 11 (DW_TAG_member)
    <319>   DW_AT_name        : (indirect string, offset: 0xffd6): APB1RSTR
    <31d>   DW_AT_decl_file   : 5
    <31e>   DW_AT_decl_line   : 425
    <320>   DW_AT_decl_column : 17
    <321>   DW_AT_type        : <0xbc>
    <325>   DW_AT_data_member_location: 16
 <2><326>: Abbrev Number: 11 (DW_TAG_member)
    <327>   DW_AT_name        : (indirect string, offset: 0xd122): AHBENR
    <32b>   DW_AT_decl_file   : 5
    <32c>   DW_AT_decl_line   : 426
    <32e>   DW_AT_decl_column : 17
    <32f>   DW_AT_type        : <0xbc>
    <333>   DW_AT_data_member_location: 20
 <2><334>: Abbrev Number: 11 (DW_TAG_member)
    <335>   DW_AT_name        : (indirect string, offset: 0x10b11): APB2ENR
    <339>   DW_AT_decl_file   : 5
    <33a>   DW_AT_decl_line   : 427
    <33c>   DW_AT_decl_column : 17
    <33d>   DW_AT_type        : <0xbc>
    <341>   DW_AT_data_member_location: 24
 <2><342>: Abbrev Number: 11 (DW_TAG_member)
    <343>   DW_AT_name        : (indirect string, offset: 0x689fb): APB1ENR
    <347>   DW_AT_decl_file   : 5
    <348>   DW_AT_decl_line   : 428
    <34a>   DW_AT_decl_column : 17
    <34b>   DW_AT_type        : <0xbc>
    <34f>   DW_AT_data_member_location: 28
 <2><350>: Abbrev Number: 11 (DW_TAG_member)
    <351>   DW_AT_name        : (indirect string, offset: 0x132dd): BDCR
    <355>   DW_AT_decl_file   : 5
    <356>   DW_AT_decl_line   : 429
    <358>   DW_AT_decl_column : 17
    <359>   DW_AT_type        : <0xbc>
    <35d>   DW_AT_data_member_location: 32
 <2><35e>: Abbrev Number: 10 (DW_TAG_member)
    <35f>   DW_AT_name        : CSR
    <363>   DW_AT_decl_file   : 5
    <364>   DW_AT_decl_line   : 430
    <366>   DW_AT_decl_column : 17
    <367>   DW_AT_type        : <0xbc>
    <36b>   DW_AT_data_member_location: 36
 <2><36c>: Abbrev Number: 0
 <1><36d>: Abbrev Number: 12 (DW_TAG_typedef)
    <36e>   DW_AT_name        : (indirect string, offset: 0x41404): RCC_TypeDef
    <372>   DW_AT_decl_file   : 5
    <373>   DW_AT_decl_line   : 433
    <375>   DW_AT_decl_column : 3
    <376>   DW_AT_type        : <0x2d7>
 <1><37a>: Abbrev Number: 9 (DW_TAG_structure_type)
    <37b>   DW_AT_byte_size   : 84
    <37c>   DW_AT_decl_file   : 5
    <37d>   DW_AT_decl_line   : 472
    <37f>   DW_AT_decl_column : 9
    <380>   DW_AT_sibling     : <0x4a9>
 <2><384>: Abbrev Number: 10 (DW_TAG_member)
    <385>   DW_AT_name        : CR1
    <389>   DW_AT_decl_file   : 5
    <38a>   DW_AT_decl_line   : 474
    <38c>   DW_AT_decl_column : 17
    <38d>   DW_AT_type        : <0xbc>
    <391>   DW_AT_data_member_location: 0
 <2><392>: Abbrev Number: 10 (DW_TAG_member)
    <393>   DW_AT_name        : CR2
    <397>   DW_AT_decl_file   : 5
    <398>   DW_AT_decl_line   : 475
    <39a>   DW_AT_decl_column : 17
    <39b>   DW_AT_type        : <0xbc>
    <39f>   DW_AT_data_member_location: 4
 <2><3a0>: Abbrev Number: 11 (DW_TAG_member)
    <3a1>   DW_AT_name        : (indirect string, offset: 0x640fb): SMCR
    <3a5>   DW_AT_decl_file   : 5
    <3a6>   DW_AT_decl_line   : 476
    <3a8>   DW_AT_decl_column : 17
    <3a9>   DW_AT_type        : <0xbc>
    <3ad>   DW_AT_data_member_location: 8
 <2><3ae>: Abbrev Number: 11 (DW_TAG_member)
    <3af>   DW_AT_name        : (indirect string, offset: 0x2cc0e): DIER
    <3b3>   DW_AT_decl_file   : 5
    <3b4>   DW_AT_decl_line   : 477
    <3b6>   DW_AT_decl_column : 17
    <3b7>   DW_AT_type        : <0xbc>
    <3bb>   DW_AT_data_member_location: 12
 <2><3bc>: Abbrev Number: 10 (DW_TAG_member)
    <3bd>   DW_AT_name        : SR
    <3c0>   DW_AT_decl_file   : 5
    <3c1>   DW_AT_decl_line   : 478
    <3c3>   DW_AT_decl_column : 17
    <3c4>   DW_AT_type        : <0xbc>
    <3c8>   DW_AT_data_member_location: 16
 <2><3c9>: Abbrev Number: 10 (DW_TAG_member)
    <3ca>   DW_AT_name        : EGR
    <3ce>   DW_AT_decl_file   : 5
    <3cf>   DW_AT_decl_line   : 479
    <3d1>   DW_AT_decl_column : 17
    <3d2>   DW_AT_type        : <0xbc>
    <3d6>   DW_AT_data_member_location: 20
 <2><3d7>: Abbrev Number: 11 (DW_TAG_member)
    <3d8>   DW_AT_name        : (indirect string, offset: 0x65c58): CCMR1
    <3dc>   DW_AT_decl_file   : 5
    <3dd>   DW_AT_decl_line   : 480
    <3df>   DW_AT_decl_column : 17
    <3e0>   DW_AT_type        : <0xbc>
    <3e4>   DW_AT_data_member_location: 24
 <2><3e5>: Abbrev Number: 11 (DW_TAG_member)
    <3e6>   DW_AT_name        : (indirect string, offset: 0x37e03): CCMR2
    <3ea>   DW_AT_decl_file   : 5
    <3eb>   DW_AT_decl_line   : 481
    <3ed>   DW_AT_decl_column : 17
    <3ee>   DW_AT_type        : <0xbc>
    <3f2>   DW_AT_data_member_location: 28
 <2><3f3>: Abbrev Number: 11 (DW_TAG_member)
    <3f4>   DW_AT_name        : (indirect string, offset: 0x18731): CCER
    <3f8>   DW_AT_decl_file   : 5
    <3f9>   DW_AT_decl_line   : 482
    <3fb>   DW_AT_decl_column : 17
    <3fc>   DW_AT_type        : <0xbc>
    <400>   DW_AT_data_member_location: 32
 <2><401>: Abbrev Number: 10 (DW_TAG_member)
    <402>   DW_AT_name        : CNT
    <406>   DW_AT_decl_file   : 5
    <407>   DW_AT_decl_line   : 483
    <409>   DW_AT_decl_column : 17
    <40a>   DW_AT_type        : <0xbc>
    <40e>   DW_AT_data_member_location: 36
 <2><40f>: Abbrev Number: 10 (DW_TAG_member)
    <410>   DW_AT_name        : PSC
    <414>   DW_AT_decl_file   : 5
    <415>   DW_AT_decl_line   : 484
    <417>   DW_AT_decl_column : 17
    <418>   DW_AT_type        : <0xbc>
    <41c>   DW_AT_data_member_location: 40
 <2><41d>: Abbrev Number: 10 (DW_TAG_member)
    <41e>   DW_AT_name        : ARR
    <422>   DW_AT_decl_file   : 5
    <423>   DW_AT_decl_line   : 485
    <425>   DW_AT_decl_column : 17
    <426>   DW_AT_type        : <0xbc>
    <42a>   DW_AT_data_member_location: 44
 <2><42b>: Abbrev Number: 10 (DW_TAG_member)
    <42c>   DW_AT_name        : RCR
    <430>   DW_AT_decl_file   : 5
    <431>   DW_AT_decl_line   : 486
    <433>   DW_AT_decl_column : 17
    <434>   DW_AT_type        : <0xbc>
    <438>   DW_AT_data_member_location: 48
 <2><439>: Abbrev Number: 11 (DW_TAG_member)
    <43a>   DW_AT_name        : (indirect string, offset: 0x10b0c): CCR1
    <43e>   DW_AT_decl_file   : 5
    <43f>   DW_AT_decl_line   : 487
    <441>   DW_AT_decl_column : 17
    <442>   DW_AT_type        : <0xbc>
    <446>   DW_AT_data_member_location: 52
 <2><447>: Abbrev Number: 11 (DW_TAG_member)
    <448>   DW_AT_name        : (indirect string, offset: 0x3afbd): CCR2
    <44c>   DW_AT_decl_file   : 5
    <44d>   DW_AT_decl_line   : 488
    <44f>   DW_AT_decl_column : 17
    <450>   DW_AT_type        : <0xbc>
    <454>   DW_AT_data_member_location: 56
 <2><455>: Abbrev Number: 11 (DW_TAG_member)
    <456>   DW_AT_name        : (indirect string, offset: 0x6a6f9): CCR3
    <45a>   DW_AT_decl_file   : 5
    <45b>   DW_AT_decl_line   : 489
    <45d>   DW_AT_decl_column : 17
    <45e>   DW_AT_type        : <0xbc>
    <462>   DW_AT_data_member_location: 60
 <2><463>: Abbrev Number: 11 (DW_TAG_member)
    <464>   DW_AT_name        : (indirect string, offset: 0x8d85): CCR4
    <468>   DW_AT_decl_file   : 5
    <469>   DW_AT_decl_line   : 490
    <46b>   DW_AT_decl_column : 17
    <46c>   DW_AT_type        : <0xbc>
    <470>   DW_AT_data_member_location: 64
 <2><471>: Abbrev Number: 11 (DW_TAG_member)
    <472>   DW_AT_name        : (indirect string, offset: 0x40b58): BDTR
    <476>   DW_AT_decl_file   : 5
    <477>   DW_AT_decl_line   : 491
    <479>   DW_AT_decl_column : 17
    <47a>   DW_AT_type        : <0xbc>
    <47e>   DW_AT_data_member_location: 68
 <2><47f>: Abbrev Number: 10 (DW_TAG_member)
    <480>   DW_AT_name        : DCR
    <484>   DW_AT_decl_file   : 5
    <485>   DW_AT_decl_line   : 492
    <487>   DW_AT_decl_column : 17
    <488>   DW_AT_type        : <0xbc>
    <48c>   DW_AT_data_member_location: 72
 <2><48d>: Abbrev Number: 11 (DW_TAG_member)
    <48e>   DW_AT_name        : (indirect string, offset: 0x77381): DMAR
    <492>   DW_AT_decl_file   : 5
    <493>   DW_AT_decl_line   : 493
    <495>   DW_AT_decl_column : 17
    <496>   DW_AT_type        : <0xbc>
    <49a>   DW_AT_data_member_location: 76
 <2><49b>: Abbrev Number: 10 (DW_TAG_member)
    <49c>   DW_AT_name        : OR
    <49f>   DW_AT_decl_file   : 5
    <4a0>   DW_AT_decl_line   : 494
    <4a2>   DW_AT_decl_column : 17
    <4a3>   DW_AT_type        : <0xbc>
    <4a7>   DW_AT_data_member_location: 80
 <2><4a8>: Abbrev Number: 0
 <1><4a9>: Abbrev Number: 12 (DW_TAG_typedef)
    <4aa>   DW_AT_name        : (indirect string, offset: 0x1d85f): TIM_TypeDef
    <4ae>   DW_AT_decl_file   : 5
    <4af>   DW_AT_decl_line   : 495
    <4b1>   DW_AT_decl_column : 2
    <4b2>   DW_AT_type        : <0x37a>
 <1><4b6>: Abbrev Number: 9 (DW_TAG_structure_type)
    <4b7>   DW_AT_byte_size   : 28
    <4b8>   DW_AT_decl_file   : 5
    <4b9>   DW_AT_decl_line   : 502
    <4bb>   DW_AT_decl_column : 9
    <4bc>   DW_AT_sibling     : <0x521>
 <2><4c0>: Abbrev Number: 10 (DW_TAG_member)
    <4c1>   DW_AT_name        : SR
    <4c4>   DW_AT_decl_file   : 5
    <4c5>   DW_AT_decl_line   : 504
    <4c7>   DW_AT_decl_column : 17
    <4c8>   DW_AT_type        : <0xbc>
    <4cc>   DW_AT_data_member_location: 0
 <2><4cd>: Abbrev Number: 10 (DW_TAG_member)
    <4ce>   DW_AT_name        : DR
    <4d1>   DW_AT_decl_file   : 5
    <4d2>   DW_AT_decl_line   : 505
    <4d4>   DW_AT_decl_column : 17
    <4d5>   DW_AT_type        : <0xbc>
    <4d9>   DW_AT_data_member_location: 4
 <2><4da>: Abbrev Number: 10 (DW_TAG_member)
    <4db>   DW_AT_name        : BRR
    <4df>   DW_AT_decl_file   : 5
    <4e0>   DW_AT_decl_line   : 506
    <4e2>   DW_AT_decl_column : 17
    <4e3>   DW_AT_type        : <0xbc>
    <4e7>   DW_AT_data_member_location: 8
 <2><4e8>: Abbrev Number: 10 (DW_TAG_member)
    <4e9>   DW_AT_name        : CR1
    <4ed>   DW_AT_decl_file   : 5
    <4ee>   DW_AT_decl_line   : 507
    <4f0>   DW_AT_decl_column : 17
    <4f1>   DW_AT_type        : <0xbc>
    <4f5>   DW_AT_data_member_location: 12
 <2><4f6>: Abbrev Number: 10 (DW_TAG_member)
    <4f7>   DW_AT_name        : CR2
    <4fb>   DW_AT_decl_file   : 5
    <4fc>   DW_AT_decl_line   : 508
    <4fe>   DW_AT_decl_column : 17
    <4ff>   DW_AT_type        : <0xbc>
    <503>   DW_AT_data_member_location: 16
 <2><504>: Abbrev Number: 10 (DW_TAG_member)
    <505>   DW_AT_name        : CR3
    <509>   DW_AT_decl_file   : 5
    <50a>   DW_AT_decl_line   : 509
    <50c>   DW_AT_decl_column : 17
    <50d>   DW_AT_type        : <0xbc>
    <511>   DW_AT_data_member_location: 20
 <2><512>: Abbrev Number: 11 (DW_TAG_member)
    <513>   DW_AT_name        : (indirect string, offset: 0x26716): GTPR
    <517>   DW_AT_decl_file   : 5
    <518>   DW_AT_decl_line   : 510
    <51a>   DW_AT_decl_column : 17
    <51b>   DW_AT_type        : <0xbc>
    <51f>   DW_AT_data_member_location: 24
 <2><520>: Abbrev Number: 0
 <1><521>: Abbrev Number: 12 (DW_TAG_typedef)
    <522>   DW_AT_name        : (indirect string, offset: 0x88ccd): USART_TypeDef
    <526>   DW_AT_decl_file   : 5
    <527>   DW_AT_decl_line   : 511
    <529>   DW_AT_decl_column : 3
    <52a>   DW_AT_type        : <0x4b6>
 <1><52e>: Abbrev Number: 13 (DW_TAG_enumeration_type)
    <52f>   DW_AT_encoding    : 7	(unsigned)
    <530>   DW_AT_byte_size   : 1
    <531>   DW_AT_type        : <0x3c>
    <535>   DW_AT_decl_file   : 6
    <536>   DW_AT_decl_line   : 158
    <537>   DW_AT_decl_column : 1
    <538>   DW_AT_sibling     : <0x549>
 <2><53c>: Abbrev Number: 14 (DW_TAG_enumerator)
    <53d>   DW_AT_name        : (indirect string, offset: 0x427e6): DISABLE
    <541>   DW_AT_const_value : 0
 <2><542>: Abbrev Number: 14 (DW_TAG_enumerator)
    <543>   DW_AT_name        : (indirect string, offset: 0x7dfc9): ENABLE
    <547>   DW_AT_const_value : 1
 <2><548>: Abbrev Number: 0
 <1><549>: Abbrev Number: 3 (DW_TAG_typedef)
    <54a>   DW_AT_name        : (indirect string, offset: 0x89291): FunctionalState
    <54e>   DW_AT_decl_file   : 6
    <54f>   DW_AT_decl_line   : 161
    <550>   DW_AT_decl_column : 3
    <551>   DW_AT_type        : <0x52e>
 <1><555>: Abbrev Number: 2 (DW_TAG_base_type)
    <556>   DW_AT_byte_size   : 8
    <557>   DW_AT_encoding    : 4	(float)
    <558>   DW_AT_name        : (indirect string, offset: 0x32e8a): long double
 <1><55c>: Abbrev Number: 13 (DW_TAG_enumeration_type)
    <55d>   DW_AT_encoding    : 7	(unsigned)
    <55e>   DW_AT_byte_size   : 1
    <55f>   DW_AT_type        : <0x3c>
    <563>   DW_AT_decl_file   : 7
    <564>   DW_AT_decl_line   : 40
    <565>   DW_AT_decl_column : 1
    <566>   DW_AT_sibling     : <0x583>
 <2><56a>: Abbrev Number: 14 (DW_TAG_enumerator)
    <56b>   DW_AT_name        : (indirect string, offset: 0x2f4b3): HAL_OK
    <56f>   DW_AT_const_value : 0
 <2><570>: Abbrev Number: 14 (DW_TAG_enumerator)
    <571>   DW_AT_name        : (indirect string, offset: 0x56ff5): HAL_ERROR
    <575>   DW_AT_const_value : 1
 <2><576>: Abbrev Number: 14 (DW_TAG_enumerator)
    <577>   DW_AT_name        : (indirect string, offset: 0x1824d): HAL_BUSY
    <57b>   DW_AT_const_value : 2
 <2><57c>: Abbrev Number: 14 (DW_TAG_enumerator)
    <57d>   DW_AT_name        : (indirect string, offset: 0x28ca4): HAL_TIMEOUT
    <581>   DW_AT_const_value : 3
 <2><582>: Abbrev Number: 0
 <1><583>: Abbrev Number: 3 (DW_TAG_typedef)
    <584>   DW_AT_name        : (indirect string, offset: 0x1b31): HAL_StatusTypeDef
    <588>   DW_AT_decl_file   : 7
    <589>   DW_AT_decl_line   : 45
    <58a>   DW_AT_decl_column : 3
    <58b>   DW_AT_type        : <0x55c>
 <1><58f>: Abbrev Number: 13 (DW_TAG_enumeration_type)
    <590>   DW_AT_encoding    : 7	(unsigned)
    <591>   DW_AT_byte_size   : 1
    <592>   DW_AT_type        : <0x3c>
    <596>   DW_AT_decl_file   : 7
    <597>   DW_AT_decl_line   : 51
    <598>   DW_AT_decl_column : 1
    <599>   DW_AT_sibling     : <0x5aa>
 <2><59d>: Abbrev Number: 14 (DW_TAG_enumerator)
    <59e>   DW_AT_name        : (indirect string, offset: 0x66ca3): HAL_UNLOCKED
    <5a2>   DW_AT_const_value : 0
 <2><5a3>: Abbrev Number: 14 (DW_TAG_enumerator)
    <5a4>   DW_AT_name        : (indirect string, offset: 0x89e4e): HAL_LOCKED
    <5a8>   DW_AT_const_value : 1
 <2><5a9>: Abbrev Number: 0
 <1><5aa>: Abbrev Number: 3 (DW_TAG_typedef)
    <5ab>   DW_AT_name        : (indirect string, offset: 0x4f34c): HAL_LockTypeDef
    <5af>   DW_AT_decl_file   : 7
    <5b0>   DW_AT_decl_line   : 54
    <5b1>   DW_AT_decl_column : 3
    <5b2>   DW_AT_type        : <0x58f>
 <1><5b6>: Abbrev Number: 6 (DW_TAG_structure_type)
    <5b7>   DW_AT_byte_size   : 12
    <5b8>   DW_AT_decl_file   : 8
    <5b9>   DW_AT_decl_line   : 49
    <5ba>   DW_AT_decl_column : 9
    <5bb>   DW_AT_sibling     : <0x5e7>
 <2><5bf>: Abbrev Number: 8 (DW_TAG_member)
    <5c0>   DW_AT_name        : (indirect string, offset: 0x5d3ed): PLLState
    <5c4>   DW_AT_decl_file   : 8
    <5c5>   DW_AT_decl_line   : 51
    <5c6>   DW_AT_decl_column : 12
    <5c7>   DW_AT_type        : <0xb0>
    <5cb>   DW_AT_data_member_location: 0
 <2><5cc>: Abbrev Number: 8 (DW_TAG_member)
    <5cd>   DW_AT_name        : (indirect string, offset: 0x5e82e): PLLSource
    <5d1>   DW_AT_decl_file   : 8
    <5d2>   DW_AT_decl_line   : 54
    <5d3>   DW_AT_decl_column : 12
    <5d4>   DW_AT_type        : <0xb0>
    <5d8>   DW_AT_data_member_location: 4
 <2><5d9>: Abbrev Number: 8 (DW_TAG_member)
    <5da>   DW_AT_name        : (indirect string, offset: 0x7c891): PLLMUL
    <5de>   DW_AT_decl_file   : 8
    <5df>   DW_AT_decl_line   : 57
    <5e0>   DW_AT_decl_column : 12
    <5e1>   DW_AT_type        : <0xb0>
    <5e5>   DW_AT_data_member_location: 8
 <2><5e6>: Abbrev Number: 0
 <1><5e7>: Abbrev Number: 3 (DW_TAG_typedef)
    <5e8>   DW_AT_name        : (indirect string, offset: 0x545b4): RCC_PLLInitTypeDef
    <5ec>   DW_AT_decl_file   : 8
    <5ed>   DW_AT_decl_line   : 59
    <5ee>   DW_AT_decl_column : 3
    <5ef>   DW_AT_type        : <0x5b6>
 <1><5f3>: Abbrev Number: 6 (DW_TAG_structure_type)
    <5f4>   DW_AT_byte_size   : 20
    <5f5>   DW_AT_decl_file   : 8
    <5f6>   DW_AT_decl_line   : 64
    <5f7>   DW_AT_decl_column : 9
    <5f8>   DW_AT_sibling     : <0x63e>
 <2><5fc>: Abbrev Number: 8 (DW_TAG_member)
    <5fd>   DW_AT_name        : (indirect string, offset: 0x2b0e0): ClockType
    <601>   DW_AT_decl_file   : 8
    <602>   DW_AT_decl_line   : 66
    <603>   DW_AT_decl_column : 12
    <604>   DW_AT_type        : <0xb0>
    <608>   DW_AT_data_member_location: 0
 <2><609>: Abbrev Number: 8 (DW_TAG_member)
    <60a>   DW_AT_name        : (indirect string, offset: 0x5419f): SYSCLKSource
    <60e>   DW_AT_decl_file   : 8
    <60f>   DW_AT_decl_line   : 69
    <610>   DW_AT_decl_column : 12
    <611>   DW_AT_type        : <0xb0>
    <615>   DW_AT_data_member_location: 4
 <2><616>: Abbrev Number: 8 (DW_TAG_member)
    <617>   DW_AT_name        : (indirect string, offset: 0x72c38): AHBCLKDivider
    <61b>   DW_AT_decl_file   : 8
    <61c>   DW_AT_decl_line   : 72
    <61d>   DW_AT_decl_column : 12
    <61e>   DW_AT_type        : <0xb0>
    <622>   DW_AT_data_member_location: 8
 <2><623>: Abbrev Number: 8 (DW_TAG_member)
    <624>   DW_AT_name        : (indirect string, offset: 0x5762): APB1CLKDivider
    <628>   DW_AT_decl_file   : 8
    <629>   DW_AT_decl_line   : 75
    <62a>   DW_AT_decl_column : 12
    <62b>   DW_AT_type        : <0xb0>
    <62f>   DW_AT_data_member_location: 12
 <2><630>: Abbrev Number: 8 (DW_TAG_member)
    <631>   DW_AT_name        : (indirect string, offset: 0x406ea): APB2CLKDivider
    <635>   DW_AT_decl_file   : 8
    <636>   DW_AT_decl_line   : 78
    <637>   DW_AT_decl_column : 12
    <638>   DW_AT_type        : <0xb0>
    <63c>   DW_AT_data_member_location: 16
 <2><63d>: Abbrev Number: 0
 <1><63e>: Abbrev Number: 3 (DW_TAG_typedef)
    <63f>   DW_AT_name        : (indirect string, offset: 0x2b12d): RCC_ClkInitTypeDef
    <643>   DW_AT_decl_file   : 8
    <644>   DW_AT_decl_line   : 80
    <645>   DW_AT_decl_column : 3
    <646>   DW_AT_type        : <0x5f3>
 <1><64a>: Abbrev Number: 6 (DW_TAG_structure_type)
    <64b>   DW_AT_byte_size   : 40
    <64c>   DW_AT_decl_file   : 9
    <64d>   DW_AT_decl_line   : 228
    <64e>   DW_AT_decl_column : 9
    <64f>   DW_AT_sibling     : <0x6bd>
 <2><653>: Abbrev Number: 8 (DW_TAG_member)
    <654>   DW_AT_name        : (indirect string, offset: 0x85b4): OscillatorType
    <658>   DW_AT_decl_file   : 9
    <659>   DW_AT_decl_line   : 230
    <65a>   DW_AT_decl_column : 12
    <65b>   DW_AT_type        : <0xb0>
    <65f>   DW_AT_data_member_location: 0
 <2><660>: Abbrev Number: 8 (DW_TAG_member)
    <661>   DW_AT_name        : (indirect string, offset: 0x5e6fc): HSEState
    <665>   DW_AT_decl_file   : 9
    <666>   DW_AT_decl_line   : 238
    <667>   DW_AT_decl_column : 12
    <668>   DW_AT_type        : <0xb0>
    <66c>   DW_AT_data_member_location: 4
 <2><66d>: Abbrev Number: 8 (DW_TAG_member)
    <66e>   DW_AT_name        : (indirect string, offset: 0x5dbd7): HSEPredivValue
    <672>   DW_AT_decl_file   : 9
    <673>   DW_AT_decl_line   : 241
    <674>   DW_AT_decl_column : 12
    <675>   DW_AT_type        : <0xb0>
    <679>   DW_AT_data_member_location: 8
 <2><67a>: Abbrev Number: 8 (DW_TAG_member)
    <67b>   DW_AT_name        : (indirect string, offset: 0x575b5): LSEState
    <67f>   DW_AT_decl_file   : 9
    <680>   DW_AT_decl_line   : 244
    <681>   DW_AT_decl_column : 12
    <682>   DW_AT_type        : <0xb0>
    <686>   DW_AT_data_member_location: 12
 <2><687>: Abbrev Number: 8 (DW_TAG_member)
    <688>   DW_AT_name        : (indirect string, offset: 0x3ec41): HSIState
    <68c>   DW_AT_decl_file   : 9
    <68d>   DW_AT_decl_line   : 247
    <68e>   DW_AT_decl_column : 12
    <68f>   DW_AT_type        : <0xb0>
    <693>   DW_AT_data_member_location: 16
 <2><694>: Abbrev Number: 8 (DW_TAG_member)
    <695>   DW_AT_name        : (indirect string, offset: 0x77524): HSICalibrationValue
    <699>   DW_AT_decl_file   : 9
    <69a>   DW_AT_decl_line   : 250
    <69b>   DW_AT_decl_column : 12
    <69c>   DW_AT_type        : <0xb0>
    <6a0>   DW_AT_data_member_location: 20
 <2><6a1>: Abbrev Number: 8 (DW_TAG_member)
    <6a2>   DW_AT_name        : (indirect string, offset: 0x7bd96): LSIState
    <6a6>   DW_AT_decl_file   : 9
    <6a7>   DW_AT_decl_line   : 253
    <6a8>   DW_AT_decl_column : 12
    <6a9>   DW_AT_type        : <0xb0>
    <6ad>   DW_AT_data_member_location: 24
 <2><6ae>: Abbrev Number: 10 (DW_TAG_member)
    <6af>   DW_AT_name        : PLL
    <6b3>   DW_AT_decl_file   : 9
    <6b4>   DW_AT_decl_line   : 256
    <6b6>   DW_AT_decl_column : 22
    <6b7>   DW_AT_type        : <0x5e7>
    <6bb>   DW_AT_data_member_location: 28
 <2><6bc>: Abbrev Number: 0
 <1><6bd>: Abbrev Number: 12 (DW_TAG_typedef)
    <6be>   DW_AT_name        : (indirect string, offset: 0x4a251): RCC_OscInitTypeDef
    <6c2>   DW_AT_decl_file   : 9
    <6c3>   DW_AT_decl_line   : 261
    <6c5>   DW_AT_decl_column : 3
    <6c6>   DW_AT_type        : <0x64a>
 <1><6ca>: Abbrev Number: 9 (DW_TAG_structure_type)
    <6cb>   DW_AT_byte_size   : 16
    <6cc>   DW_AT_decl_file   : 9
    <6cd>   DW_AT_decl_line   : 283
    <6cf>   DW_AT_decl_column : 9
    <6d0>   DW_AT_sibling     : <0x70d>
 <2><6d4>: Abbrev Number: 11 (DW_TAG_member)
    <6d5>   DW_AT_name        : (indirect string, offset: 0x7575a): PeriphClockSelection
    <6d9>   DW_AT_decl_file   : 9
    <6da>   DW_AT_decl_line   : 285
    <6dc>   DW_AT_decl_column : 12
    <6dd>   DW_AT_type        : <0xb0>
    <6e1>   DW_AT_data_member_location: 0
 <2><6e2>: Abbrev Number: 11 (DW_TAG_member)
    <6e3>   DW_AT_name        : (indirect string, offset: 0x3ba9b): RTCClockSelection
    <6e7>   DW_AT_decl_file   : 9
    <6e8>   DW_AT_decl_line   : 288
    <6ea>   DW_AT_decl_column : 12
    <6eb>   DW_AT_type        : <0xb0>
    <6ef>   DW_AT_data_member_location: 4
 <2><6f0>: Abbrev Number: 11 (DW_TAG_member)
    <6f1>   DW_AT_name        : (indirect string, offset: 0x1b2d2): AdcClockSelection
    <6f5>   DW_AT_decl_file   : 9
    <6f6>   DW_AT_decl_line   : 291
    <6f8>   DW_AT_decl_column : 12
    <6f9>   DW_AT_type        : <0xb0>
    <6fd>   DW_AT_data_member_location: 8
 <2><6fe>: Abbrev Number: 11 (DW_TAG_member)
    <6ff>   DW_AT_name        : (indirect string, offset: 0x107dc): UsbClockSelection
    <703>   DW_AT_decl_file   : 9
    <704>   DW_AT_decl_line   : 312
    <706>   DW_AT_decl_column : 12
    <707>   DW_AT_type        : <0xb0>
    <70b>   DW_AT_data_member_location: 12
 <2><70c>: Abbrev Number: 0
 <1><70d>: Abbrev Number: 12 (DW_TAG_typedef)
    <70e>   DW_AT_name        : (indirect string, offset: 0x5684c): RCC_PeriphCLKInitTypeDef
    <712>   DW_AT_decl_file   : 9
    <713>   DW_AT_decl_line   : 316
    <715>   DW_AT_decl_column : 3
    <716>   DW_AT_type        : <0x6ca>
 <1><71a>: Abbrev Number: 6 (DW_TAG_structure_type)
    <71b>   DW_AT_byte_size   : 16
    <71c>   DW_AT_decl_file   : 10
    <71d>   DW_AT_decl_line   : 47
    <71e>   DW_AT_decl_column : 9
    <71f>   DW_AT_sibling     : <0x758>
 <2><723>: Abbrev Number: 7 (DW_TAG_member)
    <724>   DW_AT_name        : Pin
    <728>   DW_AT_decl_file   : 10
    <729>   DW_AT_decl_line   : 49
    <72a>   DW_AT_decl_column : 12
    <72b>   DW_AT_type        : <0xb0>
    <72f>   DW_AT_data_member_location: 0
 <2><730>: Abbrev Number: 8 (DW_TAG_member)
    <731>   DW_AT_name        : (indirect string, offset: 0x3d396): Mode
    <735>   DW_AT_decl_file   : 10
    <736>   DW_AT_decl_line   : 52
    <737>   DW_AT_decl_column : 12
    <738>   DW_AT_type        : <0xb0>
    <73c>   DW_AT_data_member_location: 4
 <2><73d>: Abbrev Number: 8 (DW_TAG_member)
    <73e>   DW_AT_name        : (indirect string, offset: 0x2ca8): Pull
    <742>   DW_AT_decl_file   : 10
    <743>   DW_AT_decl_line   : 55
    <744>   DW_AT_decl_column : 12
    <745>   DW_AT_type        : <0xb0>
    <749>   DW_AT_data_member_location: 8
 <2><74a>: Abbrev Number: 8 (DW_TAG_member)
    <74b>   DW_AT_name        : (indirect string, offset: 0x51a4d): Speed
    <74f>   DW_AT_decl_file   : 10
    <750>   DW_AT_decl_line   : 58
    <751>   DW_AT_decl_column : 12
    <752>   DW_AT_type        : <0xb0>
    <756>   DW_AT_data_member_location: 12
 <2><757>: Abbrev Number: 0
 <1><758>: Abbrev Number: 3 (DW_TAG_typedef)
    <759>   DW_AT_name        : (indirect string, offset: 0x7fa19): GPIO_InitTypeDef
    <75d>   DW_AT_decl_file   : 10
    <75e>   DW_AT_decl_line   : 60
    <75f>   DW_AT_decl_column : 3
    <760>   DW_AT_type        : <0x71a>
 <1><764>: Abbrev Number: 13 (DW_TAG_enumeration_type)
    <765>   DW_AT_encoding    : 7	(unsigned)
    <766>   DW_AT_byte_size   : 1
    <767>   DW_AT_type        : <0x3c>
    <76b>   DW_AT_decl_file   : 10
    <76c>   DW_AT_decl_line   : 66
    <76d>   DW_AT_decl_column : 1
    <76e>   DW_AT_sibling     : <0x77f>
 <2><772>: Abbrev Number: 14 (DW_TAG_enumerator)
    <773>   DW_AT_name        : (indirect string, offset: 0x1c6fc): GPIO_PIN_RESET
    <777>   DW_AT_const_value : 0
 <2><778>: Abbrev Number: 14 (DW_TAG_enumerator)
    <779>   DW_AT_name        : (indirect string, offset: 0x184c5): GPIO_PIN_SET
    <77d>   DW_AT_const_value : 1
 <2><77e>: Abbrev Number: 0
 <1><77f>: Abbrev Number: 3 (DW_TAG_typedef)
    <780>   DW_AT_name        : (indirect string, offset: 0x8783f): GPIO_PinState
    <784>   DW_AT_decl_file   : 10
    <785>   DW_AT_decl_line   : 69
    <786>   DW_AT_decl_column : 3
    <787>   DW_AT_type        : <0x764>
 <1><78b>: Abbrev Number: 6 (DW_TAG_structure_type)
    <78c>   DW_AT_byte_size   : 28
    <78d>   DW_AT_decl_file   : 11
    <78e>   DW_AT_decl_line   : 48
    <78f>   DW_AT_decl_column : 9
    <790>   DW_AT_sibling     : <0x7f0>
 <2><794>: Abbrev Number: 8 (DW_TAG_member)
    <795>   DW_AT_name        : (indirect string, offset: 0x33c76): Direction
    <799>   DW_AT_decl_file   : 11
    <79a>   DW_AT_decl_line   : 50
    <79b>   DW_AT_decl_column : 12
    <79c>   DW_AT_type        : <0xb0>
    <7a0>   DW_AT_data_member_location: 0
 <2><7a1>: Abbrev Number: 8 (DW_TAG_member)
    <7a2>   DW_AT_name        : (indirect string, offset: 0x97be): PeriphInc
    <7a6>   DW_AT_decl_file   : 11
    <7a7>   DW_AT_decl_line   : 54
    <7a8>   DW_AT_decl_column : 12
    <7a9>   DW_AT_type        : <0xb0>
    <7ad>   DW_AT_data_member_location: 4
 <2><7ae>: Abbrev Number: 8 (DW_TAG_member)
    <7af>   DW_AT_name        : (indirect string, offset: 0x15d14): MemInc
    <7b3>   DW_AT_decl_file   : 11
    <7b4>   DW_AT_decl_line   : 57
    <7b5>   DW_AT_decl_column : 12
    <7b6>   DW_AT_type        : <0xb0>
    <7ba>   DW_AT_data_member_location: 8
 <2><7bb>: Abbrev Number: 8 (DW_TAG_member)
    <7bc>   DW_AT_name        : (indirect string, offset: 0x4564d): PeriphDataAlignment
    <7c0>   DW_AT_decl_file   : 11
    <7c1>   DW_AT_decl_line   : 60
    <7c2>   DW_AT_decl_column : 12
    <7c3>   DW_AT_type        : <0xb0>
    <7c7>   DW_AT_data_member_location: 12
 <2><7c8>: Abbrev Number: 8 (DW_TAG_member)
    <7c9>   DW_AT_name        : (indirect string, offset: 0x7d405): MemDataAlignment
    <7cd>   DW_AT_decl_file   : 11
    <7ce>   DW_AT_decl_line   : 63
    <7cf>   DW_AT_decl_column : 12
    <7d0>   DW_AT_type        : <0xb0>
    <7d4>   DW_AT_data_member_location: 16
 <2><7d5>: Abbrev Number: 8 (DW_TAG_member)
    <7d6>   DW_AT_name        : (indirect string, offset: 0x3d396): Mode
    <7da>   DW_AT_decl_file   : 11
    <7db>   DW_AT_decl_line   : 66
    <7dc>   DW_AT_decl_column : 12
    <7dd>   DW_AT_type        : <0xb0>
    <7e1>   DW_AT_data_member_location: 20
 <2><7e2>: Abbrev Number: 8 (DW_TAG_member)
    <7e3>   DW_AT_name        : (indirect string, offset: 0x8b9fc): Priority
    <7e7>   DW_AT_decl_file   : 11
    <7e8>   DW_AT_decl_line   : 71
    <7e9>   DW_AT_decl_column : 12
    <7ea>   DW_AT_type        : <0xb0>
    <7ee>   DW_AT_data_member_location: 24
 <2><7ef>: Abbrev Number: 0
 <1><7f0>: Abbrev Number: 3 (DW_TAG_typedef)
    <7f1>   DW_AT_name        : (indirect string, offset: 0x25022): DMA_InitTypeDef
    <7f5>   DW_AT_decl_file   : 11
    <7f6>   DW_AT_decl_line   : 73
    <7f7>   DW_AT_decl_column : 3
    <7f8>   DW_AT_type        : <0x78b>
 <1><7fc>: Abbrev Number: 13 (DW_TAG_enumeration_type)
    <7fd>   DW_AT_encoding    : 7	(unsigned)
    <7fe>   DW_AT_byte_size   : 1
    <7ff>   DW_AT_type        : <0x3c>
    <803>   DW_AT_decl_file   : 11
    <804>   DW_AT_decl_line   : 79
    <805>   DW_AT_decl_column : 1
    <806>   DW_AT_sibling     : <0x823>
 <2><80a>: Abbrev Number: 14 (DW_TAG_enumerator)
    <80b>   DW_AT_name        : (indirect string, offset: 0x67c64): HAL_DMA_STATE_RESET
    <80f>   DW_AT_const_value : 0
 <2><810>: Abbrev Number: 14 (DW_TAG_enumerator)
    <811>   DW_AT_name        : (indirect string, offset: 0x25f4e): HAL_DMA_STATE_READY
    <815>   DW_AT_const_value : 1
 <2><816>: Abbrev Number: 14 (DW_TAG_enumerator)
    <817>   DW_AT_name        : (indirect string, offset: 0x60ab4): HAL_DMA_STATE_BUSY
    <81b>   DW_AT_const_value : 2
 <2><81c>: Abbrev Number: 14 (DW_TAG_enumerator)
    <81d>   DW_AT_name        : (indirect string, offset: 0x87afa): HAL_DMA_STATE_TIMEOUT
    <821>   DW_AT_const_value : 3
 <2><822>: Abbrev Number: 0
 <1><823>: Abbrev Number: 3 (DW_TAG_typedef)
    <824>   DW_AT_name        : (indirect string, offset: 0x5c9ac): HAL_DMA_StateTypeDef
    <828>   DW_AT_decl_file   : 11
    <829>   DW_AT_decl_line   : 84
    <82a>   DW_AT_decl_column : 2
    <82b>   DW_AT_type        : <0x7fc>
 <1><82f>: Abbrev Number: 15 (DW_TAG_structure_type)
    <830>   DW_AT_name        : (indirect string, offset: 0x7633a): __DMA_HandleTypeDef
    <834>   DW_AT_byte_size   : 68
    <835>   DW_AT_decl_file   : 11
    <836>   DW_AT_decl_line   : 111
    <837>   DW_AT_decl_column : 16
    <838>   DW_AT_sibling     : <0x8d9>
 <2><83c>: Abbrev Number: 8 (DW_TAG_member)
    <83d>   DW_AT_name        : (indirect string, offset: 0x3677b): Instance
    <841>   DW_AT_decl_file   : 11
    <842>   DW_AT_decl_line   : 113
    <843>   DW_AT_decl_column : 26
    <844>   DW_AT_type        : <0x8d9>
    <848>   DW_AT_data_member_location: 0
 <2><849>: Abbrev Number: 8 (DW_TAG_member)
    <84a>   DW_AT_name        : (indirect string, offset: 0x27877): Init
    <84e>   DW_AT_decl_file   : 11
    <84f>   DW_AT_decl_line   : 115
    <850>   DW_AT_decl_column : 25
    <851>   DW_AT_type        : <0x7f0>
    <855>   DW_AT_data_member_location: 4
 <2><856>: Abbrev Number: 8 (DW_TAG_member)
    <857>   DW_AT_name        : (indirect string, offset: 0x63576): Lock
    <85b>   DW_AT_decl_file   : 11
    <85c>   DW_AT_decl_line   : 117
    <85d>   DW_AT_decl_column : 25
    <85e>   DW_AT_type        : <0x5aa>
    <862>   DW_AT_data_member_location: 32
 <2><863>: Abbrev Number: 8 (DW_TAG_member)
    <864>   DW_AT_name        : (indirect string, offset: 0x5e6ff): State
    <868>   DW_AT_decl_file   : 11
    <869>   DW_AT_decl_line   : 119
    <86a>   DW_AT_decl_column : 25
    <86b>   DW_AT_type        : <0x823>
    <86f>   DW_AT_data_member_location: 33
 <2><870>: Abbrev Number: 8 (DW_TAG_member)
    <871>   DW_AT_name        : (indirect string, offset: 0x836cf): Parent
    <875>   DW_AT_decl_file   : 11
    <876>   DW_AT_decl_line   : 121
    <877>   DW_AT_decl_column : 26
    <878>   DW_AT_type        : <0x8df>
    <87c>   DW_AT_data_member_location: 36
 <2><87d>: Abbrev Number: 8 (DW_TAG_member)
    <87e>   DW_AT_name        : (indirect string, offset: 0x89421): XferCpltCallback
    <882>   DW_AT_decl_file   : 11
    <883>   DW_AT_decl_line   : 123
    <884>   DW_AT_decl_column : 28
    <885>   DW_AT_type        : <0x8f2>
    <889>   DW_AT_data_member_location: 40
 <2><88a>: Abbrev Number: 8 (DW_TAG_member)
    <88b>   DW_AT_name        : (indirect string, offset: 0x6bf4f): XferHalfCpltCallback
    <88f>   DW_AT_decl_file   : 11
    <890>   DW_AT_decl_line   : 125
    <891>   DW_AT_decl_column : 28
    <892>   DW_AT_type        : <0x8f2>
    <896>   DW_AT_data_member_location: 44
 <2><897>: Abbrev Number: 8 (DW_TAG_member)
    <898>   DW_AT_name        : (indirect string, offset: 0x13e89): XferErrorCallback
    <89c>   DW_AT_decl_file   : 11
    <89d>   DW_AT_decl_line   : 127
    <89e>   DW_AT_decl_column : 28
    <89f>   DW_AT_type        : <0x8f2>
    <8a3>   DW_AT_data_member_location: 48
 <2><8a4>: Abbrev Number: 8 (DW_TAG_member)
    <8a5>   DW_AT_name        : (indirect string, offset: 0x80fb1): XferAbortCallback
    <8a9>   DW_AT_decl_file   : 11
    <8aa>   DW_AT_decl_line   : 129
    <8ab>   DW_AT_decl_column : 28
    <8ac>   DW_AT_type        : <0x8f2>
    <8b0>   DW_AT_data_member_location: 52
 <2><8b1>: Abbrev Number: 8 (DW_TAG_member)
    <8b2>   DW_AT_name        : (indirect string, offset: 0x86e6c): ErrorCode
    <8b6>   DW_AT_decl_file   : 11
    <8b7>   DW_AT_decl_line   : 131
    <8b8>   DW_AT_decl_column : 25
    <8b9>   DW_AT_type        : <0xbc>
    <8bd>   DW_AT_data_member_location: 56
 <2><8be>: Abbrev Number: 8 (DW_TAG_member)
    <8bf>   DW_AT_name        : (indirect string, offset: 0x3bdd4): DmaBaseAddress
    <8c3>   DW_AT_decl_file   : 11
    <8c4>   DW_AT_decl_line   : 133
    <8c5>   DW_AT_decl_column : 27
    <8c6>   DW_AT_type        : <0x8f8>
    <8ca>   DW_AT_data_member_location: 60
 <2><8cb>: Abbrev Number: 8 (DW_TAG_member)
    <8cc>   DW_AT_name        : (indirect string, offset: 0x1c816): ChannelIndex
    <8d0>   DW_AT_decl_file   : 11
    <8d1>   DW_AT_decl_line   : 135
    <8d2>   DW_AT_decl_column : 26
    <8d3>   DW_AT_type        : <0xb0>
    <8d7>   DW_AT_data_member_location: 64
 <2><8d8>: Abbrev Number: 0
 <1><8d9>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <8da>   DW_AT_byte_size   : 4
    <8db>   DW_AT_type        : <0x21c>
 <1><8df>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <8e0>   DW_AT_byte_size   : 4
 <1><8e1>: Abbrev Number: 18 (DW_TAG_subroutine_type)
    <8e2>   DW_AT_prototyped  : 1
    <8e2>   DW_AT_sibling     : <0x8ec>
 <2><8e6>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <8e7>   DW_AT_type        : <0x8ec>
 <2><8eb>: Abbrev Number: 0
 <1><8ec>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <8ed>   DW_AT_byte_size   : 4
    <8ee>   DW_AT_type        : <0x82f>
 <1><8f2>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <8f3>   DW_AT_byte_size   : 4
    <8f4>   DW_AT_type        : <0x8e1>
 <1><8f8>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <8f9>   DW_AT_byte_size   : 4
    <8fa>   DW_AT_type        : <0x250>
 <1><8fe>: Abbrev Number: 3 (DW_TAG_typedef)
    <8ff>   DW_AT_name        : (indirect string, offset: 0x7633c): DMA_HandleTypeDef
    <903>   DW_AT_decl_file   : 11
    <904>   DW_AT_decl_line   : 137
    <905>   DW_AT_decl_column : 3
    <906>   DW_AT_type        : <0x82f>
 <1><90a>: Abbrev Number: 6 (DW_TAG_structure_type)
    <90b>   DW_AT_byte_size   : 28
    <90c>   DW_AT_decl_file   : 12
    <90d>   DW_AT_decl_line   : 53
    <90e>   DW_AT_decl_column : 9
    <90f>   DW_AT_sibling     : <0x96f>
 <2><913>: Abbrev Number: 8 (DW_TAG_member)
    <914>   DW_AT_name        : (indirect string, offset: 0x1e11a): DataAlign
    <918>   DW_AT_decl_file   : 12
    <919>   DW_AT_decl_line   : 55
    <91a>   DW_AT_decl_column : 12
    <91b>   DW_AT_type        : <0xb0>
    <91f>   DW_AT_data_member_location: 0
 <2><920>: Abbrev Number: 8 (DW_TAG_member)
    <921>   DW_AT_name        : (indirect string, offset: 0x5406b): ScanConvMode
    <925>   DW_AT_decl_file   : 12
    <926>   DW_AT_decl_line   : 58
    <927>   DW_AT_decl_column : 12
    <928>   DW_AT_type        : <0xb0>
    <92c>   DW_AT_data_member_location: 4
 <2><92d>: Abbrev Number: 8 (DW_TAG_member)
    <92e>   DW_AT_name        : (indirect string, offset: 0x3b015): ContinuousConvMode
    <932>   DW_AT_decl_file   : 12
    <933>   DW_AT_decl_line   : 69
    <934>   DW_AT_decl_column : 19
    <935>   DW_AT_type        : <0x549>
    <939>   DW_AT_data_member_location: 8
 <2><93a>: Abbrev Number: 8 (DW_TAG_member)
    <93b>   DW_AT_name        : (indirect string, offset: 0x8b6ef): NbrOfConversion
    <93f>   DW_AT_decl_file   : 12
    <940>   DW_AT_decl_line   : 72
    <941>   DW_AT_decl_column : 12
    <942>   DW_AT_type        : <0xb0>
    <946>   DW_AT_data_member_location: 12
 <2><947>: Abbrev Number: 8 (DW_TAG_member)
    <948>   DW_AT_name        : (indirect string, offset: 0x8b7b7): DiscontinuousConvMode
    <94c>   DW_AT_decl_file   : 12
    <94d>   DW_AT_decl_line   : 75
    <94e>   DW_AT_decl_column : 20
    <94f>   DW_AT_type        : <0x549>
    <953>   DW_AT_data_member_location: 16
 <2><954>: Abbrev Number: 8 (DW_TAG_member)
    <955>   DW_AT_name        : (indirect string, offset: 0x817b3): NbrOfDiscConversion
    <959>   DW_AT_decl_file   : 12
    <95a>   DW_AT_decl_line   : 79
    <95b>   DW_AT_decl_column : 12
    <95c>   DW_AT_type        : <0xb0>
    <960>   DW_AT_data_member_location: 20
 <2><961>: Abbrev Number: 8 (DW_TAG_member)
    <962>   DW_AT_name        : (indirect string, offset: 0x646bc): ExternalTrigConv
    <966>   DW_AT_decl_file   : 12
    <967>   DW_AT_decl_line   : 82
    <968>   DW_AT_decl_column : 12
    <969>   DW_AT_type        : <0xb0>
    <96d>   DW_AT_data_member_location: 24
 <2><96e>: Abbrev Number: 0
 <1><96f>: Abbrev Number: 3 (DW_TAG_typedef)
    <970>   DW_AT_name        : (indirect string, offset: 0x20679): ADC_InitTypeDef
    <974>   DW_AT_decl_file   : 12
    <975>   DW_AT_decl_line   : 86
    <976>   DW_AT_decl_column : 2
    <977>   DW_AT_type        : <0x90a>
 <1><97b>: Abbrev Number: 6 (DW_TAG_structure_type)
    <97c>   DW_AT_byte_size   : 12
    <97d>   DW_AT_decl_file   : 12
    <97e>   DW_AT_decl_line   : 93
    <97f>   DW_AT_decl_column : 9
    <980>   DW_AT_sibling     : <0x9ac>
 <2><984>: Abbrev Number: 8 (DW_TAG_member)
    <985>   DW_AT_name        : (indirect string, offset: 0x8b684): Channel
    <989>   DW_AT_decl_file   : 12
    <98a>   DW_AT_decl_line   : 95
    <98b>   DW_AT_decl_column : 12
    <98c>   DW_AT_type        : <0xb0>
    <990>   DW_AT_data_member_location: 0
 <2><991>: Abbrev Number: 8 (DW_TAG_member)
    <992>   DW_AT_name        : (indirect string, offset: 0x8b707): Rank
    <996>   DW_AT_decl_file   : 12
    <997>   DW_AT_decl_line   : 102
    <998>   DW_AT_decl_column : 12
    <999>   DW_AT_type        : <0xb0>
    <99d>   DW_AT_data_member_location: 4
 <2><99e>: Abbrev Number: 8 (DW_TAG_member)
    <99f>   DW_AT_name        : (indirect string, offset: 0x8b7d5): SamplingTime
    <9a3>   DW_AT_decl_file   : 12
    <9a4>   DW_AT_decl_line   : 105
    <9a5>   DW_AT_decl_column : 12
    <9a6>   DW_AT_type        : <0xb0>
    <9aa>   DW_AT_data_member_location: 8
 <2><9ab>: Abbrev Number: 0
 <1><9ac>: Abbrev Number: 3 (DW_TAG_typedef)
    <9ad>   DW_AT_name        : (indirect string, offset: 0x89855): ADC_ChannelConfTypeDef
    <9b1>   DW_AT_decl_file   : 12
    <9b2>   DW_AT_decl_line   : 114
    <9b3>   DW_AT_decl_column : 2
    <9b4>   DW_AT_type        : <0x97b>
 <1><9b8>: Abbrev Number: 15 (DW_TAG_structure_type)
    <9b9>   DW_AT_name        : (indirect string, offset: 0x4e05a): __ADC_HandleTypeDef
    <9bd>   DW_AT_byte_size   : 48
    <9be>   DW_AT_decl_file   : 12
    <9bf>   DW_AT_decl_line   : 176
    <9c0>   DW_AT_decl_column : 16
    <9c1>   DW_AT_sibling     : <0xa14>
 <2><9c5>: Abbrev Number: 8 (DW_TAG_member)
    <9c6>   DW_AT_name        : (indirect string, offset: 0x3677b): Instance
    <9ca>   DW_AT_decl_file   : 12
    <9cb>   DW_AT_decl_line   : 178
    <9cc>   DW_AT_decl_column : 34
    <9cd>   DW_AT_type        : <0xa14>
    <9d1>   DW_AT_data_member_location: 0
 <2><9d2>: Abbrev Number: 8 (DW_TAG_member)
    <9d3>   DW_AT_name        : (indirect string, offset: 0x27877): Init
    <9d7>   DW_AT_decl_file   : 12
    <9d8>   DW_AT_decl_line   : 180
    <9d9>   DW_AT_decl_column : 33
    <9da>   DW_AT_type        : <0x96f>
    <9de>   DW_AT_data_member_location: 4
 <2><9df>: Abbrev Number: 8 (DW_TAG_member)
    <9e0>   DW_AT_name        : (indirect string, offset: 0x1928): DMA_Handle
    <9e4>   DW_AT_decl_file   : 12
    <9e5>   DW_AT_decl_line   : 182
    <9e6>   DW_AT_decl_column : 34
    <9e7>   DW_AT_type        : <0xa1a>
    <9eb>   DW_AT_data_member_location: 32
 <2><9ec>: Abbrev Number: 8 (DW_TAG_member)
    <9ed>   DW_AT_name        : (indirect string, offset: 0x63576): Lock
    <9f1>   DW_AT_decl_file   : 12
    <9f2>   DW_AT_decl_line   : 184
    <9f3>   DW_AT_decl_column : 33
    <9f4>   DW_AT_type        : <0x5aa>
    <9f8>   DW_AT_data_member_location: 36
 <2><9f9>: Abbrev Number: 8 (DW_TAG_member)
    <9fa>   DW_AT_name        : (indirect string, offset: 0x5e6ff): State
    <9fe>   DW_AT_decl_file   : 12
    <9ff>   DW_AT_decl_line   : 186
    <a00>   DW_AT_decl_column : 33
    <a01>   DW_AT_type        : <0xbc>
    <a05>   DW_AT_data_member_location: 40
 <2><a06>: Abbrev Number: 8 (DW_TAG_member)
    <a07>   DW_AT_name        : (indirect string, offset: 0x86e6c): ErrorCode
    <a0b>   DW_AT_decl_file   : 12
    <a0c>   DW_AT_decl_line   : 188
    <a0d>   DW_AT_decl_column : 33
    <a0e>   DW_AT_type        : <0xbc>
    <a12>   DW_AT_data_member_location: 44
 <2><a13>: Abbrev Number: 0
 <1><a14>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <a15>   DW_AT_byte_size   : 4
    <a16>   DW_AT_type        : <0x1cd>
 <1><a1a>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <a1b>   DW_AT_byte_size   : 4
    <a1c>   DW_AT_type        : <0x8fe>
 <1><a20>: Abbrev Number: 3 (DW_TAG_typedef)
    <a21>   DW_AT_name        : (indirect string, offset: 0x4e05c): ADC_HandleTypeDef
    <a25>   DW_AT_decl_file   : 12
    <a26>   DW_AT_decl_line   : 199
    <a27>   DW_AT_decl_column : 2
    <a28>   DW_AT_type        : <0x9b8>
 <1><a2c>: Abbrev Number: 6 (DW_TAG_structure_type)
    <a2d>   DW_AT_byte_size   : 24
    <a2e>   DW_AT_decl_file   : 13
    <a2f>   DW_AT_decl_line   : 47
    <a30>   DW_AT_decl_column : 9
    <a31>   DW_AT_sibling     : <0xa84>
 <2><a35>: Abbrev Number: 8 (DW_TAG_member)
    <a36>   DW_AT_name        : (indirect string, offset: 0x8c96d): Prescaler
    <a3a>   DW_AT_decl_file   : 13
    <a3b>   DW_AT_decl_line   : 49
    <a3c>   DW_AT_decl_column : 12
    <a3d>   DW_AT_type        : <0xb0>
    <a41>   DW_AT_data_member_location: 0
 <2><a42>: Abbrev Number: 8 (DW_TAG_member)
    <a43>   DW_AT_name        : (indirect string, offset: 0x7dc70): CounterMode
    <a47>   DW_AT_decl_file   : 13
    <a48>   DW_AT_decl_line   : 52
    <a49>   DW_AT_decl_column : 12
    <a4a>   DW_AT_type        : <0xb0>
    <a4e>   DW_AT_data_member_location: 4
 <2><a4f>: Abbrev Number: 8 (DW_TAG_member)
    <a50>   DW_AT_name        : (indirect string, offset: 0x11706): Period
    <a54>   DW_AT_decl_file   : 13
    <a55>   DW_AT_decl_line   : 55
    <a56>   DW_AT_decl_column : 12
    <a57>   DW_AT_type        : <0xb0>
    <a5b>   DW_AT_data_member_location: 8
 <2><a5c>: Abbrev Number: 8 (DW_TAG_member)
    <a5d>   DW_AT_name        : (indirect string, offset: 0x38f36): ClockDivision
    <a61>   DW_AT_decl_file   : 13
    <a62>   DW_AT_decl_line   : 59
    <a63>   DW_AT_decl_column : 12
    <a64>   DW_AT_type        : <0xb0>
    <a68>   DW_AT_data_member_location: 12
 <2><a69>: Abbrev Number: 8 (DW_TAG_member)
    <a6a>   DW_AT_name        : (indirect string, offset: 0x61b92): RepetitionCounter
    <a6e>   DW_AT_decl_file   : 13
    <a6f>   DW_AT_decl_line   : 62
    <a70>   DW_AT_decl_column : 12
    <a71>   DW_AT_type        : <0xb0>
    <a75>   DW_AT_data_member_location: 16
 <2><a76>: Abbrev Number: 8 (DW_TAG_member)
    <a77>   DW_AT_name        : (indirect string, offset: 0xe1df): AutoReloadPreload
    <a7b>   DW_AT_decl_file   : 13
    <a7c>   DW_AT_decl_line   : 73
    <a7d>   DW_AT_decl_column : 12
    <a7e>   DW_AT_type        : <0xb0>
    <a82>   DW_AT_data_member_location: 20
 <2><a83>: Abbrev Number: 0
 <1><a84>: Abbrev Number: 3 (DW_TAG_typedef)
    <a85>   DW_AT_name        : (indirect string, offset: 0x7c3f8): TIM_Base_InitTypeDef
    <a89>   DW_AT_decl_file   : 13
    <a8a>   DW_AT_decl_line   : 75
    <a8b>   DW_AT_decl_column : 3
    <a8c>   DW_AT_type        : <0xa2c>
 <1><a90>: Abbrev Number: 6 (DW_TAG_structure_type)
    <a91>   DW_AT_byte_size   : 28
    <a92>   DW_AT_decl_file   : 13
    <a93>   DW_AT_decl_line   : 80
    <a94>   DW_AT_decl_column : 9
    <a95>   DW_AT_sibling     : <0xaf5>
 <2><a99>: Abbrev Number: 8 (DW_TAG_member)
    <a9a>   DW_AT_name        : (indirect string, offset: 0x3d394): OCMode
    <a9e>   DW_AT_decl_file   : 13
    <a9f>   DW_AT_decl_line   : 82
    <aa0>   DW_AT_decl_column : 12
    <aa1>   DW_AT_type        : <0xb0>
    <aa5>   DW_AT_data_member_location: 0
 <2><aa6>: Abbrev Number: 8 (DW_TAG_member)
    <aa7>   DW_AT_name        : (indirect string, offset: 0x4a491): Pulse
    <aab>   DW_AT_decl_file   : 13
    <aac>   DW_AT_decl_line   : 85
    <aad>   DW_AT_decl_column : 12
    <aae>   DW_AT_type        : <0xb0>
    <ab2>   DW_AT_data_member_location: 4
 <2><ab3>: Abbrev Number: 8 (DW_TAG_member)
    <ab4>   DW_AT_name        : (indirect string, offset: 0x5b7bf): OCPolarity
    <ab8>   DW_AT_decl_file   : 13
    <ab9>   DW_AT_decl_line   : 88
    <aba>   DW_AT_decl_column : 12
    <abb>   DW_AT_type        : <0xb0>
    <abf>   DW_AT_data_member_location: 8
 <2><ac0>: Abbrev Number: 8 (DW_TAG_member)
    <ac1>   DW_AT_name        : (indirect string, offset: 0x17c26): OCNPolarity
    <ac5>   DW_AT_decl_file   : 13
    <ac6>   DW_AT_decl_line   : 91
    <ac7>   DW_AT_decl_column : 12
    <ac8>   DW_AT_type        : <0xb0>
    <acc>   DW_AT_data_member_location: 12
 <2><acd>: Abbrev Number: 8 (DW_TAG_member)
    <ace>   DW_AT_name        : (indirect string, offset: 0x13d94): OCFastMode
    <ad2>   DW_AT_decl_file   : 13
    <ad3>   DW_AT_decl_line   : 95
    <ad4>   DW_AT_decl_column : 12
    <ad5>   DW_AT_type        : <0xb0>
    <ad9>   DW_AT_data_member_location: 16
 <2><ada>: Abbrev Number: 8 (DW_TAG_member)
    <adb>   DW_AT_name        : (indirect string, offset: 0x3664a): OCIdleState
    <adf>   DW_AT_decl_file   : 13
    <ae0>   DW_AT_decl_line   : 100
    <ae1>   DW_AT_decl_column : 12
    <ae2>   DW_AT_type        : <0xb0>
    <ae6>   DW_AT_data_member_location: 20
 <2><ae7>: Abbrev Number: 8 (DW_TAG_member)
    <ae8>   DW_AT_name        : (indirect string, offset: 0x128f6): OCNIdleState
    <aec>   DW_AT_decl_file   : 13
    <aed>   DW_AT_decl_line   : 104
    <aee>   DW_AT_decl_column : 12
    <aef>   DW_AT_type        : <0xb0>
    <af3>   DW_AT_data_member_location: 24
 <2><af4>: Abbrev Number: 0
 <1><af5>: Abbrev Number: 3 (DW_TAG_typedef)
    <af6>   DW_AT_name        : (indirect string, offset: 0xdb71): TIM_OC_InitTypeDef
    <afa>   DW_AT_decl_file   : 13
    <afb>   DW_AT_decl_line   : 107
    <afc>   DW_AT_decl_column : 3
    <afd>   DW_AT_type        : <0xa90>
 <1><b01>: Abbrev Number: 6 (DW_TAG_structure_type)
    <b02>   DW_AT_byte_size   : 16
    <b03>   DW_AT_decl_file   : 13
    <b04>   DW_AT_decl_line   : 148
    <b05>   DW_AT_decl_column : 9
    <b06>   DW_AT_sibling     : <0xb3f>
 <2><b0a>: Abbrev Number: 8 (DW_TAG_member)
    <b0b>   DW_AT_name        : (indirect string, offset: 0x8c459): ICPolarity
    <b0f>   DW_AT_decl_file   : 13
    <b10>   DW_AT_decl_line   : 150
    <b11>   DW_AT_decl_column : 13
    <b12>   DW_AT_type        : <0xb0>
    <b16>   DW_AT_data_member_location: 0
 <2><b17>: Abbrev Number: 8 (DW_TAG_member)
    <b18>   DW_AT_name        : (indirect string, offset: 0x8c535): ICSelection
    <b1c>   DW_AT_decl_file   : 13
    <b1d>   DW_AT_decl_line   : 153
    <b1e>   DW_AT_decl_column : 12
    <b1f>   DW_AT_type        : <0xb0>
    <b23>   DW_AT_data_member_location: 4
 <2><b24>: Abbrev Number: 8 (DW_TAG_member)
    <b25>   DW_AT_name        : (indirect string, offset: 0x19064): ICPrescaler
    <b29>   DW_AT_decl_file   : 13
    <b2a>   DW_AT_decl_line   : 156
    <b2b>   DW_AT_decl_column : 12
    <b2c>   DW_AT_type        : <0xb0>
    <b30>   DW_AT_data_member_location: 8
 <2><b31>: Abbrev Number: 8 (DW_TAG_member)
    <b32>   DW_AT_name        : (indirect string, offset: 0x8c3b4): ICFilter
    <b36>   DW_AT_decl_file   : 13
    <b37>   DW_AT_decl_line   : 159
    <b38>   DW_AT_decl_column : 12
    <b39>   DW_AT_type        : <0xb0>
    <b3d>   DW_AT_data_member_location: 12
 <2><b3e>: Abbrev Number: 0
 <1><b3f>: Abbrev Number: 3 (DW_TAG_typedef)
    <b40>   DW_AT_name        : (indirect string, offset: 0x40005): TIM_IC_InitTypeDef
    <b44>   DW_AT_decl_file   : 13
    <b45>   DW_AT_decl_line   : 161
    <b46>   DW_AT_decl_column : 3
    <b47>   DW_AT_type        : <0xb01>
 <1><b4b>: Abbrev Number: 6 (DW_TAG_structure_type)
    <b4c>   DW_AT_byte_size   : 16
    <b4d>   DW_AT_decl_file   : 13
    <b4e>   DW_AT_decl_line   : 199
    <b4f>   DW_AT_decl_column : 9
    <b50>   DW_AT_sibling     : <0xb89>
 <2><b54>: Abbrev Number: 8 (DW_TAG_member)
    <b55>   DW_AT_name        : (indirect string, offset: 0x14929): ClockSource
    <b59>   DW_AT_decl_file   : 13
    <b5a>   DW_AT_decl_line   : 201
    <b5b>   DW_AT_decl_column : 12
    <b5c>   DW_AT_type        : <0xb0>
    <b60>   DW_AT_data_member_location: 0
 <2><b61>: Abbrev Number: 8 (DW_TAG_member)
    <b62>   DW_AT_name        : (indirect string, offset: 0x4d078): ClockPolarity
    <b66>   DW_AT_decl_file   : 13
    <b67>   DW_AT_decl_line   : 203
    <b68>   DW_AT_decl_column : 12
    <b69>   DW_AT_type        : <0xb0>
    <b6d>   DW_AT_data_member_location: 4
 <2><b6e>: Abbrev Number: 8 (DW_TAG_member)
    <b6f>   DW_AT_name        : (indirect string, offset: 0x7a278): ClockPrescaler
    <b73>   DW_AT_decl_file   : 13
    <b74>   DW_AT_decl_line   : 205
    <b75>   DW_AT_decl_column : 12
    <b76>   DW_AT_type        : <0xb0>
    <b7a>   DW_AT_data_member_location: 8
 <2><b7b>: Abbrev Number: 8 (DW_TAG_member)
    <b7c>   DW_AT_name        : (indirect string, offset: 0x597bb): ClockFilter
    <b80>   DW_AT_decl_file   : 13
    <b81>   DW_AT_decl_line   : 207
    <b82>   DW_AT_decl_column : 12
    <b83>   DW_AT_type        : <0xb0>
    <b87>   DW_AT_data_member_location: 12
 <2><b88>: Abbrev Number: 0
 <1><b89>: Abbrev Number: 3 (DW_TAG_typedef)
    <b8a>   DW_AT_name        : (indirect string, offset: 0x4a14): TIM_ClockConfigTypeDef
    <b8e>   DW_AT_decl_file   : 13
    <b8f>   DW_AT_decl_line   : 209
    <b90>   DW_AT_decl_column : 3
    <b91>   DW_AT_type        : <0xb4b>
 <1><b95>: Abbrev Number: 6 (DW_TAG_structure_type)
    <b96>   DW_AT_byte_size   : 8
    <b97>   DW_AT_decl_file   : 13
    <b98>   DW_AT_decl_line   : 232
    <b99>   DW_AT_decl_column : 9
    <b9a>   DW_AT_sibling     : <0xbb9>
 <2><b9e>: Abbrev Number: 8 (DW_TAG_member)
    <b9f>   DW_AT_name        : (indirect string, offset: 0x52093): MasterOutputTrigger
    <ba3>   DW_AT_decl_file   : 13
    <ba4>   DW_AT_decl_line   : 234
    <ba5>   DW_AT_decl_column : 13
    <ba6>   DW_AT_type        : <0xb0>
    <baa>   DW_AT_data_member_location: 0
 <2><bab>: Abbrev Number: 8 (DW_TAG_member)
    <bac>   DW_AT_name        : (indirect string, offset: 0x497e1): MasterSlaveMode
    <bb0>   DW_AT_decl_file   : 13
    <bb1>   DW_AT_decl_line   : 236
    <bb2>   DW_AT_decl_column : 13
    <bb3>   DW_AT_type        : <0xb0>
    <bb7>   DW_AT_data_member_location: 4
 <2><bb8>: Abbrev Number: 0
 <1><bb9>: Abbrev Number: 3 (DW_TAG_typedef)
    <bba>   DW_AT_name        : (indirect string, offset: 0x64a34): TIM_MasterConfigTypeDef
    <bbe>   DW_AT_decl_file   : 13
    <bbf>   DW_AT_decl_line   : 243
    <bc0>   DW_AT_decl_column : 3
    <bc1>   DW_AT_type        : <0xb95>
 <1><bc5>: Abbrev Number: 20 (DW_TAG_enumeration_type)
    <bc6>   DW_AT_encoding    : 7	(unsigned)
    <bc7>   DW_AT_byte_size   : 1
    <bc8>   DW_AT_type        : <0x3c>
    <bcc>   DW_AT_decl_file   : 13
    <bcd>   DW_AT_decl_line   : 292
    <bcf>   DW_AT_decl_column : 1
    <bd0>   DW_AT_sibling     : <0xbf3>
 <2><bd4>: Abbrev Number: 14 (DW_TAG_enumerator)
    <bd5>   DW_AT_name        : (indirect string, offset: 0x463d2): HAL_TIM_STATE_RESET
    <bd9>   DW_AT_const_value : 0
 <2><bda>: Abbrev Number: 14 (DW_TAG_enumerator)
    <bdb>   DW_AT_name        : (indirect string, offset: 0x520f): HAL_TIM_STATE_READY
    <bdf>   DW_AT_const_value : 1
 <2><be0>: Abbrev Number: 14 (DW_TAG_enumerator)
    <be1>   DW_AT_name        : (indirect string, offset: 0x22b45): HAL_TIM_STATE_BUSY
    <be5>   DW_AT_const_value : 2
 <2><be6>: Abbrev Number: 14 (DW_TAG_enumerator)
    <be7>   DW_AT_name        : (indirect string, offset: 0x741b6): HAL_TIM_STATE_TIMEOUT
    <beb>   DW_AT_const_value : 3
 <2><bec>: Abbrev Number: 14 (DW_TAG_enumerator)
    <bed>   DW_AT_name        : (indirect string, offset: 0x332fb): HAL_TIM_STATE_ERROR
    <bf1>   DW_AT_const_value : 4
 <2><bf2>: Abbrev Number: 0
 <1><bf3>: Abbrev Number: 12 (DW_TAG_typedef)
    <bf4>   DW_AT_name        : (indirect string, offset: 0x64d62): HAL_TIM_StateTypeDef
    <bf8>   DW_AT_decl_file   : 13
    <bf9>   DW_AT_decl_line   : 298
    <bfb>   DW_AT_decl_column : 3
    <bfc>   DW_AT_type        : <0xbc5>
 <1><c00>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <c01>   DW_AT_type        : <0xbf3>
 <1><c05>: Abbrev Number: 20 (DW_TAG_enumeration_type)
    <c06>   DW_AT_encoding    : 7	(unsigned)
    <c07>   DW_AT_byte_size   : 1
    <c08>   DW_AT_type        : <0x3c>
    <c0c>   DW_AT_decl_file   : 13
    <c0d>   DW_AT_decl_line   : 304
    <c0f>   DW_AT_decl_column : 1
    <c10>   DW_AT_sibling     : <0xc27>
 <2><c14>: Abbrev Number: 14 (DW_TAG_enumerator)
    <c15>   DW_AT_name        : (indirect string, offset: 0x31b3f): HAL_TIM_CHANNEL_STATE_RESET
    <c19>   DW_AT_const_value : 0
 <2><c1a>: Abbrev Number: 14 (DW_TAG_enumerator)
    <c1b>   DW_AT_name        : (indirect string, offset: 0x51cc5): HAL_TIM_CHANNEL_STATE_READY
    <c1f>   DW_AT_const_value : 1
 <2><c20>: Abbrev Number: 14 (DW_TAG_enumerator)
    <c21>   DW_AT_name        : (indirect string, offset: 0x4380c): HAL_TIM_CHANNEL_STATE_BUSY
    <c25>   DW_AT_const_value : 2
 <2><c26>: Abbrev Number: 0
 <1><c27>: Abbrev Number: 12 (DW_TAG_typedef)
    <c28>   DW_AT_name        : (indirect string, offset: 0x1cddd): HAL_TIM_ChannelStateTypeDef
    <c2c>   DW_AT_decl_file   : 13
    <c2d>   DW_AT_decl_line   : 308
    <c2f>   DW_AT_decl_column : 3
    <c30>   DW_AT_type        : <0xc05>
 <1><c34>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <c35>   DW_AT_type        : <0xc27>
 <1><c39>: Abbrev Number: 20 (DW_TAG_enumeration_type)
    <c3a>   DW_AT_encoding    : 7	(unsigned)
    <c3b>   DW_AT_byte_size   : 1
    <c3c>   DW_AT_type        : <0x3c>
    <c40>   DW_AT_decl_file   : 13
    <c41>   DW_AT_decl_line   : 314
    <c43>   DW_AT_decl_column : 1
    <c44>   DW_AT_sibling     : <0xc5b>
 <2><c48>: Abbrev Number: 14 (DW_TAG_enumerator)
    <c49>   DW_AT_name        : (indirect string, offset: 0x2db1): HAL_DMA_BURST_STATE_RESET
    <c4d>   DW_AT_const_value : 0
 <2><c4e>: Abbrev Number: 14 (DW_TAG_enumerator)
    <c4f>   DW_AT_name        : (indirect string, offset: 0x4ce03): HAL_DMA_BURST_STATE_READY
    <c53>   DW_AT_const_value : 1
 <2><c54>: Abbrev Number: 14 (DW_TAG_enumerator)
    <c55>   DW_AT_name        : (indirect string, offset: 0x68704): HAL_DMA_BURST_STATE_BUSY
    <c59>   DW_AT_const_value : 2
 <2><c5a>: Abbrev Number: 0
 <1><c5b>: Abbrev Number: 12 (DW_TAG_typedef)
    <c5c>   DW_AT_name        : (indirect string, offset: 0x12b7c): HAL_TIM_DMABurstStateTypeDef
    <c60>   DW_AT_decl_file   : 13
    <c61>   DW_AT_decl_line   : 318
    <c63>   DW_AT_decl_column : 3
    <c64>   DW_AT_type        : <0xc39>
 <1><c68>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <c69>   DW_AT_type        : <0xc5b>
 <1><c6d>: Abbrev Number: 20 (DW_TAG_enumeration_type)
    <c6e>   DW_AT_encoding    : 7	(unsigned)
    <c6f>   DW_AT_byte_size   : 1
    <c70>   DW_AT_type        : <0x3c>
    <c74>   DW_AT_decl_file   : 13
    <c75>   DW_AT_decl_line   : 324
    <c77>   DW_AT_decl_column : 1
    <c78>   DW_AT_sibling     : <0xc9b>
 <2><c7c>: Abbrev Number: 14 (DW_TAG_enumerator)
    <c7d>   DW_AT_name        : (indirect string, offset: 0x4e3fc): HAL_TIM_ACTIVE_CHANNEL_1
    <c81>   DW_AT_const_value : 1
 <2><c82>: Abbrev Number: 14 (DW_TAG_enumerator)
    <c83>   DW_AT_name        : (indirect string, offset: 0x4e415): HAL_TIM_ACTIVE_CHANNEL_2
    <c87>   DW_AT_const_value : 2
 <2><c88>: Abbrev Number: 14 (DW_TAG_enumerator)
    <c89>   DW_AT_name        : (indirect string, offset: 0x4e42e): HAL_TIM_ACTIVE_CHANNEL_3
    <c8d>   DW_AT_const_value : 4
 <2><c8e>: Abbrev Number: 14 (DW_TAG_enumerator)
    <c8f>   DW_AT_name        : (indirect string, offset: 0x4e447): HAL_TIM_ACTIVE_CHANNEL_4
    <c93>   DW_AT_const_value : 8
 <2><c94>: Abbrev Number: 14 (DW_TAG_enumerator)
    <c95>   DW_AT_name        : (indirect string, offset: 0x39cc6): HAL_TIM_ACTIVE_CHANNEL_CLEARED
    <c99>   DW_AT_const_value : 0
 <2><c9a>: Abbrev Number: 0
 <1><c9b>: Abbrev Number: 12 (DW_TAG_typedef)
    <c9c>   DW_AT_name        : (indirect string, offset: 0x1bdcc): HAL_TIM_ActiveChannel
    <ca0>   DW_AT_decl_file   : 13
    <ca1>   DW_AT_decl_line   : 330
    <ca3>   DW_AT_decl_column : 3
    <ca4>   DW_AT_type        : <0xc6d>
 <1><ca8>: Abbrev Number: 9 (DW_TAG_structure_type)
    <ca9>   DW_AT_byte_size   : 72
    <caa>   DW_AT_decl_file   : 13
    <cab>   DW_AT_decl_line   : 338
    <cad>   DW_AT_decl_column : 9
    <cae>   DW_AT_sibling     : <0xd31>
 <2><cb2>: Abbrev Number: 11 (DW_TAG_member)
    <cb3>   DW_AT_name        : (indirect string, offset: 0x3677b): Instance
    <cb7>   DW_AT_decl_file   : 13
    <cb8>   DW_AT_decl_line   : 341
    <cba>   DW_AT_decl_column : 39
    <cbb>   DW_AT_type        : <0xd31>
    <cbf>   DW_AT_data_member_location: 0
 <2><cc0>: Abbrev Number: 11 (DW_TAG_member)
    <cc1>   DW_AT_name        : (indirect string, offset: 0x27877): Init
    <cc5>   DW_AT_decl_file   : 13
    <cc6>   DW_AT_decl_line   : 342
    <cc8>   DW_AT_decl_column : 38
    <cc9>   DW_AT_type        : <0xa84>
    <ccd>   DW_AT_data_member_location: 4
 <2><cce>: Abbrev Number: 11 (DW_TAG_member)
    <ccf>   DW_AT_name        : (indirect string, offset: 0x8b684): Channel
    <cd3>   DW_AT_decl_file   : 13
    <cd4>   DW_AT_decl_line   : 343
    <cd6>   DW_AT_decl_column : 38
    <cd7>   DW_AT_type        : <0xc9b>
    <cdb>   DW_AT_data_member_location: 28
 <2><cdc>: Abbrev Number: 11 (DW_TAG_member)
    <cdd>   DW_AT_name        : (indirect string, offset: 0x53a9e): hdma
    <ce1>   DW_AT_decl_file   : 13
    <ce2>   DW_AT_decl_line   : 344
    <ce4>   DW_AT_decl_column : 39
    <ce5>   DW_AT_type        : <0xd37>
    <ce9>   DW_AT_data_member_location: 32
 <2><cea>: Abbrev Number: 11 (DW_TAG_member)
    <ceb>   DW_AT_name        : (indirect string, offset: 0x63576): Lock
    <cef>   DW_AT_decl_file   : 13
    <cf0>   DW_AT_decl_line   : 346
    <cf2>   DW_AT_decl_column : 38
    <cf3>   DW_AT_type        : <0x5aa>
    <cf7>   DW_AT_data_member_location: 60
 <2><cf8>: Abbrev Number: 11 (DW_TAG_member)
    <cf9>   DW_AT_name        : (indirect string, offset: 0x5e6ff): State
    <cfd>   DW_AT_decl_file   : 13
    <cfe>   DW_AT_decl_line   : 347
    <d00>   DW_AT_decl_column : 38
    <d01>   DW_AT_type        : <0xc00>
    <d05>   DW_AT_data_member_location: 61
 <2><d06>: Abbrev Number: 11 (DW_TAG_member)
    <d07>   DW_AT_name        : (indirect string, offset: 0x8ce5c): ChannelState
    <d0b>   DW_AT_decl_file   : 13
    <d0c>   DW_AT_decl_line   : 348
    <d0e>   DW_AT_decl_column : 38
    <d0f>   DW_AT_type        : <0xd57>
    <d13>   DW_AT_data_member_location: 62
 <2><d14>: Abbrev Number: 11 (DW_TAG_member)
    <d15>   DW_AT_name        : (indirect string, offset: 0x8d3e7): ChannelNState
    <d19>   DW_AT_decl_file   : 13
    <d1a>   DW_AT_decl_line   : 349
    <d1c>   DW_AT_decl_column : 38
    <d1d>   DW_AT_type        : <0xd57>
    <d21>   DW_AT_data_member_location: 66
 <2><d22>: Abbrev Number: 11 (DW_TAG_member)
    <d23>   DW_AT_name        : (indirect string, offset: 0x8ca25): DMABurstState
    <d27>   DW_AT_decl_file   : 13
    <d28>   DW_AT_decl_line   : 350
    <d2a>   DW_AT_decl_column : 38
    <d2b>   DW_AT_type        : <0xc68>
    <d2f>   DW_AT_data_member_location: 70
 <2><d30>: Abbrev Number: 0
 <1><d31>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <d32>   DW_AT_byte_size   : 4
    <d33>   DW_AT_type        : <0x4a9>
 <1><d37>: Abbrev Number: 21 (DW_TAG_array_type)
    <d38>   DW_AT_type        : <0xa1a>
    <d3c>   DW_AT_sibling     : <0xd47>
 <2><d40>: Abbrev Number: 22 (DW_TAG_subrange_type)
    <d41>   DW_AT_type        : <0x8c>
    <d45>   DW_AT_upper_bound : 6
 <2><d46>: Abbrev Number: 0
 <1><d47>: Abbrev Number: 21 (DW_TAG_array_type)
    <d48>   DW_AT_type        : <0xc34>
    <d4c>   DW_AT_sibling     : <0xd57>
 <2><d50>: Abbrev Number: 22 (DW_TAG_subrange_type)
    <d51>   DW_AT_type        : <0x8c>
    <d55>   DW_AT_upper_bound : 3
 <2><d56>: Abbrev Number: 0
 <1><d57>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <d58>   DW_AT_type        : <0xd47>
 <1><d5c>: Abbrev Number: 12 (DW_TAG_typedef)
    <d5d>   DW_AT_name        : (indirect string, offset: 0x30132): TIM_HandleTypeDef
    <d61>   DW_AT_decl_file   : 13
    <d62>   DW_AT_decl_line   : 381
    <d64>   DW_AT_decl_column : 3
    <d65>   DW_AT_type        : <0xca8>
 <1><d69>: Abbrev Number: 6 (DW_TAG_structure_type)
    <d6a>   DW_AT_byte_size   : 28
    <d6b>   DW_AT_decl_file   : 14
    <d6c>   DW_AT_decl_line   : 47
    <d6d>   DW_AT_decl_column : 9
    <d6e>   DW_AT_sibling     : <0xdce>
 <2><d72>: Abbrev Number: 8 (DW_TAG_member)
    <d73>   DW_AT_name        : (indirect string, offset: 0x7e7ab): BaudRate
    <d77>   DW_AT_decl_file   : 14
    <d78>   DW_AT_decl_line   : 49
    <d79>   DW_AT_decl_column : 12
    <d7a>   DW_AT_type        : <0xb0>
    <d7e>   DW_AT_data_member_location: 0
 <2><d7f>: Abbrev Number: 8 (DW_TAG_member)
    <d80>   DW_AT_name        : (indirect string, offset: 0x415b): WordLength
    <d84>   DW_AT_decl_file   : 14
    <d85>   DW_AT_decl_line   : 54
    <d86>   DW_AT_decl_column : 12
    <d87>   DW_AT_type        : <0xb0>
    <d8b>   DW_AT_data_member_location: 4
 <2><d8c>: Abbrev Number: 8 (DW_TAG_member)
    <d8d>   DW_AT_name        : (indirect string, offset: 0x7eab3): StopBits
    <d91>   DW_AT_decl_file   : 14
    <d92>   DW_AT_decl_line   : 57
    <d93>   DW_AT_decl_column : 12
    <d94>   DW_AT_type        : <0xb0>
    <d98>   DW_AT_data_member_location: 8
 <2><d99>: Abbrev Number: 8 (DW_TAG_member)
    <d9a>   DW_AT_name        : (indirect string, offset: 0x32517): Parity
    <d9e>   DW_AT_decl_file   : 14
    <d9f>   DW_AT_decl_line   : 60
    <da0>   DW_AT_decl_column : 12
    <da1>   DW_AT_type        : <0xb0>
    <da5>   DW_AT_data_member_location: 12
 <2><da6>: Abbrev Number: 8 (DW_TAG_member)
    <da7>   DW_AT_name        : (indirect string, offset: 0x3d396): Mode
    <dab>   DW_AT_decl_file   : 14
    <dac>   DW_AT_decl_line   : 67
    <dad>   DW_AT_decl_column : 12
    <dae>   DW_AT_type        : <0xb0>
    <db2>   DW_AT_data_member_location: 16
 <2><db3>: Abbrev Number: 8 (DW_TAG_member)
    <db4>   DW_AT_name        : (indirect string, offset: 0x10811): HwFlowCtl
    <db8>   DW_AT_decl_file   : 14
    <db9>   DW_AT_decl_line   : 70
    <dba>   DW_AT_decl_column : 12
    <dbb>   DW_AT_type        : <0xb0>
    <dbf>   DW_AT_data_member_location: 20
 <2><dc0>: Abbrev Number: 8 (DW_TAG_member)
    <dc1>   DW_AT_name        : (indirect string, offset: 0x747f9): OverSampling
    <dc5>   DW_AT_decl_file   : 14
    <dc6>   DW_AT_decl_line   : 73
    <dc7>   DW_AT_decl_column : 12
    <dc8>   DW_AT_type        : <0xb0>
    <dcc>   DW_AT_data_member_location: 24
 <2><dcd>: Abbrev Number: 0
 <1><dce>: Abbrev Number: 3 (DW_TAG_typedef)
    <dcf>   DW_AT_name        : (indirect string, offset: 0x26f60): UART_InitTypeDef
    <dd3>   DW_AT_decl_file   : 14
    <dd4>   DW_AT_decl_line   : 76
    <dd5>   DW_AT_decl_column : 3
    <dd6>   DW_AT_type        : <0xd69>
 <1><dda>: Abbrev Number: 13 (DW_TAG_enumeration_type)
    <ddb>   DW_AT_encoding    : 7	(unsigned)
    <ddc>   DW_AT_byte_size   : 1
    <ddd>   DW_AT_type        : <0x3c>
    <de1>   DW_AT_decl_file   : 14
    <de2>   DW_AT_decl_line   : 118
    <de3>   DW_AT_decl_column : 1
    <de4>   DW_AT_sibling     : <0xe19>
 <2><de8>: Abbrev Number: 14 (DW_TAG_enumerator)
    <de9>   DW_AT_name        : (indirect string, offset: 0x3b939): HAL_UART_STATE_RESET
    <ded>   DW_AT_const_value : 0
 <2><dee>: Abbrev Number: 14 (DW_TAG_enumerator)
    <def>   DW_AT_name        : (indirect string, offset: 0x76958): HAL_UART_STATE_READY
    <df3>   DW_AT_const_value : 32
 <2><df4>: Abbrev Number: 14 (DW_TAG_enumerator)
    <df5>   DW_AT_name        : (indirect string, offset: 0x7d69d): HAL_UART_STATE_BUSY
    <df9>   DW_AT_const_value : 36
 <2><dfa>: Abbrev Number: 14 (DW_TAG_enumerator)
    <dfb>   DW_AT_name        : (indirect string, offset: 0x1bf3): HAL_UART_STATE_BUSY_TX
    <dff>   DW_AT_const_value : 33
 <2><e00>: Abbrev Number: 14 (DW_TAG_enumerator)
    <e01>   DW_AT_name        : (indirect string, offset: 0x11b6): HAL_UART_STATE_BUSY_RX
    <e05>   DW_AT_const_value : 34
 <2><e06>: Abbrev Number: 14 (DW_TAG_enumerator)
    <e07>   DW_AT_name        : (indirect string, offset: 0x1eefd): HAL_UART_STATE_BUSY_TX_RX
    <e0b>   DW_AT_const_value : 35
 <2><e0c>: Abbrev Number: 14 (DW_TAG_enumerator)
    <e0d>   DW_AT_name        : (indirect string, offset: 0x43efc): HAL_UART_STATE_TIMEOUT
    <e11>   DW_AT_const_value : 160
 <2><e12>: Abbrev Number: 14 (DW_TAG_enumerator)
    <e13>   DW_AT_name        : (indirect string, offset: 0x61521): HAL_UART_STATE_ERROR
    <e17>   DW_AT_const_value : 224
 <2><e18>: Abbrev Number: 0
 <1><e19>: Abbrev Number: 3 (DW_TAG_typedef)
    <e1a>   DW_AT_name        : (indirect string, offset: 0x2b018): HAL_UART_StateTypeDef
    <e1e>   DW_AT_decl_file   : 14
    <e1f>   DW_AT_decl_line   : 136
    <e20>   DW_AT_decl_column : 3
    <e21>   DW_AT_type        : <0xdda>
 <1><e25>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <e26>   DW_AT_type        : <0xe19>
 <1><e2a>: Abbrev Number: 3 (DW_TAG_typedef)
    <e2b>   DW_AT_name        : (indirect string, offset: 0x3969a): HAL_UART_RxTypeTypeDef
    <e2f>   DW_AT_decl_file   : 14
    <e30>   DW_AT_decl_line   : 145
    <e31>   DW_AT_decl_column : 18
    <e32>   DW_AT_type        : <0xb0>
 <1><e36>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <e37>   DW_AT_type        : <0xe2a>
 <1><e3b>: Abbrev Number: 15 (DW_TAG_structure_type)
    <e3c>   DW_AT_name        : (indirect string, offset: 0x50ad8): __UART_HandleTypeDef
    <e40>   DW_AT_byte_size   : 68
    <e41>   DW_AT_decl_file   : 14
    <e42>   DW_AT_decl_line   : 150
    <e43>   DW_AT_decl_column : 16
    <e44>   DW_AT_sibling     : <0xf0c>
 <2><e48>: Abbrev Number: 8 (DW_TAG_member)
    <e49>   DW_AT_name        : (indirect string, offset: 0x3677b): Instance
    <e4d>   DW_AT_decl_file   : 14
    <e4e>   DW_AT_decl_line   : 152
    <e4f>   DW_AT_decl_column : 34
    <e50>   DW_AT_type        : <0xf0c>
    <e54>   DW_AT_data_member_location: 0
 <2><e55>: Abbrev Number: 8 (DW_TAG_member)
    <e56>   DW_AT_name        : (indirect string, offset: 0x27877): Init
    <e5a>   DW_AT_decl_file   : 14
    <e5b>   DW_AT_decl_line   : 154
    <e5c>   DW_AT_decl_column : 33
    <e5d>   DW_AT_type        : <0xdce>
    <e61>   DW_AT_data_member_location: 4
 <2><e62>: Abbrev Number: 8 (DW_TAG_member)
    <e63>   DW_AT_name        : (indirect string, offset: 0x43123): pTxBuffPtr
    <e67>   DW_AT_decl_file   : 14
    <e68>   DW_AT_decl_line   : 156
    <e69>   DW_AT_decl_column : 34
    <e6a>   DW_AT_type        : <0xf12>
    <e6e>   DW_AT_data_member_location: 32
 <2><e6f>: Abbrev Number: 8 (DW_TAG_member)
    <e70>   DW_AT_name        : (indirect string, offset: 0x3b42c): TxXferSize
    <e74>   DW_AT_decl_file   : 14
    <e75>   DW_AT_decl_line   : 158
    <e76>   DW_AT_decl_column : 33
    <e77>   DW_AT_type        : <0x9f>
    <e7b>   DW_AT_data_member_location: 36
 <2><e7c>: Abbrev Number: 8 (DW_TAG_member)
    <e7d>   DW_AT_name        : (indirect string, offset: 0x43dba): TxXferCount
    <e81>   DW_AT_decl_file   : 14
    <e82>   DW_AT_decl_line   : 160
    <e83>   DW_AT_decl_column : 33
    <e84>   DW_AT_type        : <0xab>
    <e88>   DW_AT_data_member_location: 38
 <2><e89>: Abbrev Number: 8 (DW_TAG_member)
    <e8a>   DW_AT_name        : (indirect string, offset: 0x805f0): pRxBuffPtr
    <e8e>   DW_AT_decl_file   : 14
    <e8f>   DW_AT_decl_line   : 162
    <e90>   DW_AT_decl_column : 34
    <e91>   DW_AT_type        : <0xf12>
    <e95>   DW_AT_data_member_location: 40
 <2><e96>: Abbrev Number: 8 (DW_TAG_member)
    <e97>   DW_AT_name        : (indirect string, offset: 0x42b3a): RxXferSize
    <e9b>   DW_AT_decl_file   : 14
    <e9c>   DW_AT_decl_line   : 164
    <e9d>   DW_AT_decl_column : 33
    <e9e>   DW_AT_type        : <0x9f>
    <ea2>   DW_AT_data_member_location: 44
 <2><ea3>: Abbrev Number: 8 (DW_TAG_member)
    <ea4>   DW_AT_name        : (indirect string, offset: 0x53c02): RxXferCount
    <ea8>   DW_AT_decl_file   : 14
    <ea9>   DW_AT_decl_line   : 166
    <eaa>   DW_AT_decl_column : 33
    <eab>   DW_AT_type        : <0xab>
    <eaf>   DW_AT_data_member_location: 46
 <2><eb0>: Abbrev Number: 8 (DW_TAG_member)
    <eb1>   DW_AT_name        : (indirect string, offset: 0x73fe7): ReceptionType
    <eb5>   DW_AT_decl_file   : 14
    <eb6>   DW_AT_decl_line   : 168
    <eb7>   DW_AT_decl_column : 31
    <eb8>   DW_AT_type        : <0xe36>
    <ebc>   DW_AT_data_member_location: 48
 <2><ebd>: Abbrev Number: 8 (DW_TAG_member)
    <ebe>   DW_AT_name        : (indirect string, offset: 0x86643): hdmatx
    <ec2>   DW_AT_decl_file   : 14
    <ec3>   DW_AT_decl_line   : 170
    <ec4>   DW_AT_decl_column : 34
    <ec5>   DW_AT_type        : <0xa1a>
    <ec9>   DW_AT_data_member_location: 52
 <2><eca>: Abbrev Number: 8 (DW_TAG_member)
    <ecb>   DW_AT_name        : (indirect string, offset: 0x85d25): hdmarx
    <ecf>   DW_AT_decl_file   : 14
    <ed0>   DW_AT_decl_line   : 172
    <ed1>   DW_AT_decl_column : 34
    <ed2>   DW_AT_type        : <0xa1a>
    <ed6>   DW_AT_data_member_location: 56
 <2><ed7>: Abbrev Number: 8 (DW_TAG_member)
    <ed8>   DW_AT_name        : (indirect string, offset: 0x63576): Lock
    <edc>   DW_AT_decl_file   : 14
    <edd>   DW_AT_decl_line   : 174
    <ede>   DW_AT_decl_column : 33
    <edf>   DW_AT_type        : <0x5aa>
    <ee3>   DW_AT_data_member_location: 60
 <2><ee4>: Abbrev Number: 8 (DW_TAG_member)
    <ee5>   DW_AT_name        : (indirect string, offset: 0x38ed4): gState
    <ee9>   DW_AT_decl_file   : 14
    <eea>   DW_AT_decl_line   : 176
    <eeb>   DW_AT_decl_column : 33
    <eec>   DW_AT_type        : <0xe25>
    <ef0>   DW_AT_data_member_location: 61
 <2><ef1>: Abbrev Number: 8 (DW_TAG_member)
    <ef2>   DW_AT_name        : (indirect string, offset: 0x7ce60): RxState
    <ef6>   DW_AT_decl_file   : 14
    <ef7>   DW_AT_decl_line   : 180
    <ef8>   DW_AT_decl_column : 33
    <ef9>   DW_AT_type        : <0xe25>
    <efd>   DW_AT_data_member_location: 62
 <2><efe>: Abbrev Number: 8 (DW_TAG_member)
    <eff>   DW_AT_name        : (indirect string, offset: 0x86e6c): ErrorCode
    <f03>   DW_AT_decl_file   : 14
    <f04>   DW_AT_decl_line   : 183
    <f05>   DW_AT_decl_column : 33
    <f06>   DW_AT_type        : <0xbc>
    <f0a>   DW_AT_data_member_location: 64
 <2><f0b>: Abbrev Number: 0
 <1><f0c>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <f0d>   DW_AT_byte_size   : 4
    <f0e>   DW_AT_type        : <0x521>
 <1><f12>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <f13>   DW_AT_byte_size   : 4
    <f14>   DW_AT_type        : <0x93>
 <1><f18>: Abbrev Number: 3 (DW_TAG_typedef)
    <f19>   DW_AT_name        : (indirect string, offset: 0x50ada): UART_HandleTypeDef
    <f1d>   DW_AT_decl_file   : 14
    <f1e>   DW_AT_decl_line   : 201
    <f1f>   DW_AT_decl_column : 3
    <f20>   DW_AT_type        : <0xe3b>
 <1><f24>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <f25>   DW_AT_byte_size   : 4
    <f26>   DW_AT_type        : <0xf2a>
 <1><f2a>: Abbrev Number: 2 (DW_TAG_base_type)
    <f2b>   DW_AT_byte_size   : 1
    <f2c>   DW_AT_encoding    : 8	(unsigned char)
    <f2d>   DW_AT_name        : (indirect string, offset: 0x45db0): char
 <1><f31>: Abbrev Number: 23 (DW_TAG_const_type)
    <f32>   DW_AT_type        : <0xf2a>
 <1><f36>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <f37>   DW_AT_byte_size   : 4
    <f38>   DW_AT_type        : <0xf31>
 <1><f3c>: Abbrev Number: 2 (DW_TAG_base_type)
    <f3d>   DW_AT_byte_size   : 4
    <f3e>   DW_AT_encoding    : 4	(float)
    <f3f>   DW_AT_name        : (indirect string, offset: 0x29667): float
 <1><f43>: Abbrev Number: 2 (DW_TAG_base_type)
    <f44>   DW_AT_byte_size   : 8
    <f45>   DW_AT_encoding    : 4	(float)
    <f46>   DW_AT_name        : (indirect string, offset: 0x32e8f): double
 <1><f4a>: Abbrev Number: 6 (DW_TAG_structure_type)
    <f4b>   DW_AT_byte_size   : 36
    <f4c>   DW_AT_decl_file   : 15
    <f4d>   DW_AT_decl_line   : 22
    <f4e>   DW_AT_decl_column : 9
    <f4f>   DW_AT_sibling     : <0xfc9>
 <2><f53>: Abbrev Number: 8 (DW_TAG_member)
    <f54>   DW_AT_name        : (indirect string, offset: 0x63a14): EN_PORT
    <f58>   DW_AT_decl_file   : 15
    <f59>   DW_AT_decl_line   : 23
    <f5a>   DW_AT_decl_column : 16
    <f5b>   DW_AT_type        : <0xfc9>
    <f5f>   DW_AT_data_member_location: 0
 <2><f60>: Abbrev Number: 8 (DW_TAG_member)
    <f61>   DW_AT_name        : (indirect string, offset: 0x4ebe9): EN_PIN
    <f65>   DW_AT_decl_file   : 15
    <f66>   DW_AT_decl_line   : 24
    <f67>   DW_AT_decl_column : 11
    <f68>   DW_AT_type        : <0xb0>
    <f6c>   DW_AT_data_member_location: 4
 <2><f6d>: Abbrev Number: 8 (DW_TAG_member)
    <f6e>   DW_AT_name        : (indirect string, offset: 0x3f5db): STATE_EN
    <f72>   DW_AT_decl_file   : 15
    <f73>   DW_AT_decl_line   : 25
    <f74>   DW_AT_decl_column : 11
    <f75>   DW_AT_type        : <0xb0>
    <f79>   DW_AT_data_member_location: 8
 <2><f7a>: Abbrev Number: 8 (DW_TAG_member)
    <f7b>   DW_AT_name        : (indirect string, offset: 0x85f53): DIR_PORT
    <f7f>   DW_AT_decl_file   : 15
    <f80>   DW_AT_decl_line   : 27
    <f81>   DW_AT_decl_column : 16
    <f82>   DW_AT_type        : <0xfc9>
    <f86>   DW_AT_data_member_location: 12
 <2><f87>: Abbrev Number: 8 (DW_TAG_member)
    <f88>   DW_AT_name        : (indirect string, offset: 0x6ad7d): DIR_PIN
    <f8c>   DW_AT_decl_file   : 15
    <f8d>   DW_AT_decl_line   : 28
    <f8e>   DW_AT_decl_column : 11
    <f8f>   DW_AT_type        : <0xb0>
    <f93>   DW_AT_data_member_location: 16
 <2><f94>: Abbrev Number: 8 (DW_TAG_member)
    <f95>   DW_AT_name        : (indirect string, offset: 0x5d7f3): direction
    <f99>   DW_AT_decl_file   : 15
    <f9a>   DW_AT_decl_line   : 29
    <f9b>   DW_AT_decl_column : 11
    <f9c>   DW_AT_type        : <0xb0>
    <fa0>   DW_AT_data_member_location: 20
 <2><fa1>: Abbrev Number: 8 (DW_TAG_member)
    <fa2>   DW_AT_name        : (indirect string, offset: 0x4417e): PUL_TIM
    <fa6>   DW_AT_decl_file   : 15
    <fa7>   DW_AT_decl_line   : 31
    <fa8>   DW_AT_decl_column : 21
    <fa9>   DW_AT_type        : <0xfcf>
    <fad>   DW_AT_data_member_location: 24
 <2><fae>: Abbrev Number: 8 (DW_TAG_member)
    <faf>   DW_AT_name        : (indirect string, offset: 0x8b684): Channel
    <fb3>   DW_AT_decl_file   : 15
    <fb4>   DW_AT_decl_line   : 32
    <fb5>   DW_AT_decl_column : 11
    <fb6>   DW_AT_type        : <0xb0>
    <fba>   DW_AT_data_member_location: 28
 <2><fbb>: Abbrev Number: 8 (DW_TAG_member)
    <fbc>   DW_AT_name        : (indirect string, offset: 0x595a9): compare
    <fc0>   DW_AT_decl_file   : 15
    <fc1>   DW_AT_decl_line   : 33
    <fc2>   DW_AT_decl_column : 11
    <fc3>   DW_AT_type        : <0xb0>
    <fc7>   DW_AT_data_member_location: 32
 <2><fc8>: Abbrev Number: 0
 <1><fc9>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <fca>   DW_AT_byte_size   : 4
    <fcb>   DW_AT_type        : <0x2ca>
 <1><fcf>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <fd0>   DW_AT_byte_size   : 4
    <fd1>   DW_AT_type        : <0xd5c>
 <1><fd5>: Abbrev Number: 3 (DW_TAG_typedef)
    <fd6>   DW_AT_name        : (indirect string, offset: 0x4e909): DRIVER_Name
    <fda>   DW_AT_decl_file   : 15
    <fdb>   DW_AT_decl_line   : 34
    <fdc>   DW_AT_decl_column : 2
    <fdd>   DW_AT_type        : <0xf4a>
 <1><fe1>: Abbrev Number: 24 (DW_TAG_variable)
    <fe2>   DW_AT_name        : (indirect string, offset: 0x3938f): hadc1
    <fe6>   DW_AT_decl_file   : 1
    <fe7>   DW_AT_decl_line   : 52
    <fe8>   DW_AT_decl_column : 19
    <fe9>   DW_AT_type        : <0xa20>
    <fed>   DW_AT_external    : 1
    <fed>   DW_AT_location    : 5 byte block: 3 8c 0 0 20 	(DW_OP_addr: 2000008c)
 <1><ff3>: Abbrev Number: 24 (DW_TAG_variable)
    <ff4>   DW_AT_name        : (indirect string, offset: 0x7b91c): htim1
    <ff8>   DW_AT_decl_file   : 1
    <ff9>   DW_AT_decl_line   : 54
    <ffa>   DW_AT_decl_column : 19
    <ffb>   DW_AT_type        : <0xd5c>
    <fff>   DW_AT_external    : 1
    <fff>   DW_AT_location    : 5 byte block: 3 bc 0 0 20 	(DW_OP_addr: 200000bc)
 <1><1005>: Abbrev Number: 24 (DW_TAG_variable)
    <1006>   DW_AT_name        : (indirect string, offset: 0x54d66): htim2
    <100a>   DW_AT_decl_file   : 1
    <100b>   DW_AT_decl_line   : 55
    <100c>   DW_AT_decl_column : 19
    <100d>   DW_AT_type        : <0xd5c>
    <1011>   DW_AT_external    : 1
    <1011>   DW_AT_location    : 5 byte block: 3 4 1 0 20 	(DW_OP_addr: 20000104)
 <1><1017>: Abbrev Number: 24 (DW_TAG_variable)
    <1018>   DW_AT_name        : (indirect string, offset: 0x54d6c): htim3
    <101c>   DW_AT_decl_file   : 1
    <101d>   DW_AT_decl_line   : 56
    <101e>   DW_AT_decl_column : 19
    <101f>   DW_AT_type        : <0xd5c>
    <1023>   DW_AT_external    : 1
    <1023>   DW_AT_location    : 5 byte block: 3 4c 1 0 20 	(DW_OP_addr: 2000014c)
 <1><1029>: Abbrev Number: 24 (DW_TAG_variable)
    <102a>   DW_AT_name        : (indirect string, offset: 0x4acc4): huart1
    <102e>   DW_AT_decl_file   : 1
    <102f>   DW_AT_decl_line   : 58
    <1030>   DW_AT_decl_column : 20
    <1031>   DW_AT_type        : <0xf18>
    <1035>   DW_AT_external    : 1
    <1035>   DW_AT_location    : 5 byte block: 3 94 1 0 20 	(DW_OP_addr: 20000194)
 <1><103b>: Abbrev Number: 24 (DW_TAG_variable)
    <103c>   DW_AT_name        : (indirect string, offset: 0x39390): adc1
    <1040>   DW_AT_decl_file   : 1
    <1041>   DW_AT_decl_line   : 78
    <1042>   DW_AT_decl_column : 10
    <1043>   DW_AT_type        : <0xb0>
    <1047>   DW_AT_external    : 1
    <1047>   DW_AT_location    : 5 byte block: 3 d8 1 0 20 	(DW_OP_addr: 200001d8)
 <1><104d>: Abbrev Number: 24 (DW_TAG_variable)
    <104e>   DW_AT_name        : (indirect string, offset: 0x284c3): adc2
    <1052>   DW_AT_decl_file   : 1
    <1053>   DW_AT_decl_line   : 79
    <1054>   DW_AT_decl_column : 10
    <1055>   DW_AT_type        : <0xb0>
    <1059>   DW_AT_external    : 1
    <1059>   DW_AT_location    : 5 byte block: 3 dc 1 0 20 	(DW_OP_addr: 200001dc)
 <1><105f>: Abbrev Number: 24 (DW_TAG_variable)
    <1060>   DW_AT_name        : (indirect string, offset: 0x284c8): adc3
    <1064>   DW_AT_decl_file   : 1
    <1065>   DW_AT_decl_line   : 80
    <1066>   DW_AT_decl_column : 10
    <1067>   DW_AT_type        : <0xb0>
    <106b>   DW_AT_external    : 1
    <106b>   DW_AT_location    : 5 byte block: 3 e0 1 0 20 	(DW_OP_addr: 200001e0)
 <1><1071>: Abbrev Number: 24 (DW_TAG_variable)
    <1072>   DW_AT_name        : (indirect string, offset: 0x3a024): counter
    <1076>   DW_AT_decl_file   : 1
    <1077>   DW_AT_decl_line   : 81
    <1078>   DW_AT_decl_column : 10
    <1079>   DW_AT_type        : <0xb0>
    <107d>   DW_AT_external    : 1
    <107d>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><1083>: Abbrev Number: 21 (DW_TAG_array_type)
    <1084>   DW_AT_type        : <0xf2a>
    <1088>   DW_AT_sibling     : <0x1093>
 <2><108c>: Abbrev Number: 22 (DW_TAG_subrange_type)
    <108d>   DW_AT_type        : <0x8c>
    <1091>   DW_AT_upper_bound : 20
 <2><1092>: Abbrev Number: 0
 <1><1093>: Abbrev Number: 24 (DW_TAG_variable)
    <1094>   DW_AT_name        : (indirect string, offset: 0x8d9e4): data
    <1098>   DW_AT_decl_file   : 1
    <1099>   DW_AT_decl_line   : 83
    <109a>   DW_AT_decl_column : 6
    <109b>   DW_AT_type        : <0x1083>
    <109f>   DW_AT_external    : 1
    <109f>   DW_AT_location    : 5 byte block: 3 e4 1 0 20 	(DW_OP_addr: 200001e4)
 <1><10a5>: Abbrev Number: 21 (DW_TAG_array_type)
    <10a6>   DW_AT_type        : <0xf2a>
    <10aa>   DW_AT_sibling     : <0x10b5>
 <2><10ae>: Abbrev Number: 22 (DW_TAG_subrange_type)
    <10af>   DW_AT_type        : <0x8c>
    <10b3>   DW_AT_upper_bound : 3
 <2><10b4>: Abbrev Number: 0
 <1><10b5>: Abbrev Number: 25 (DW_TAG_variable)
    <10b6>   DW_AT_name        : str
    <10ba>   DW_AT_decl_file   : 1
    <10bb>   DW_AT_decl_line   : 84
    <10bc>   DW_AT_decl_column : 6
    <10bd>   DW_AT_type        : <0x10a5>
    <10c1>   DW_AT_external    : 1
    <10c1>   DW_AT_location    : 5 byte block: 3 fc 1 0 20 	(DW_OP_addr: 200001fc)
 <1><10c7>: Abbrev Number: 24 (DW_TAG_variable)
    <10c8>   DW_AT_name        : (indirect string, offset: 0x39424): read_uart
    <10cc>   DW_AT_decl_file   : 1
    <10cd>   DW_AT_decl_line   : 85
    <10ce>   DW_AT_decl_column : 5
    <10cf>   DW_AT_type        : <0x85>
    <10d3>   DW_AT_external    : 1
    <10d3>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><10d9>: Abbrev Number: 24 (DW_TAG_variable)
    <10da>   DW_AT_name        : (indirect string, offset: 0x520f7): pos1
    <10de>   DW_AT_decl_file   : 1
    <10df>   DW_AT_decl_line   : 87
    <10e0>   DW_AT_decl_column : 10
    <10e1>   DW_AT_type        : <0xb0>
    <10e5>   DW_AT_external    : 1
    <10e5>   DW_AT_location    : 5 byte block: 3 0 2 0 20 	(DW_OP_addr: 20000200)
 <1><10eb>: Abbrev Number: 24 (DW_TAG_variable)
    <10ec>   DW_AT_name        : (indirect string, offset: 0x520fc): pos2
    <10f0>   DW_AT_decl_file   : 1
    <10f1>   DW_AT_decl_line   : 88
    <10f2>   DW_AT_decl_column : 10
    <10f3>   DW_AT_type        : <0xb0>
    <10f7>   DW_AT_external    : 1
    <10f7>   DW_AT_location    : 5 byte block: 3 4 2 0 20 	(DW_OP_addr: 20000204)
 <1><10fd>: Abbrev Number: 24 (DW_TAG_variable)
    <10fe>   DW_AT_name        : (indirect string, offset: 0x52101): pos3
    <1102>   DW_AT_decl_file   : 1
